Repository: pH7Software/pH7-Social-Dating-CMS
Catalog: _protected/app/langs/*/LC_MESSAGES/global.po
Languages: nl_nl

source: Dashboard
nl_nl: Controlepaneel

source: Statistics
nl_nl: Statistieken

source: Site statistics
nl_nl: Site statistieken

source: No user were found.
nl_nl: Geen gebruikers zijn gevonden.

source: Browse Users
nl_nl: Blader door Gebruikers

source: Total Users: %0%
nl_nl: Totaal aantal Gebruikers: %0%

source: Add a User
nl_nl: Gebruiker Toevoegen

source: Import Users
nl_nl: Importeer Gebruikers

source: Search Users
nl_nl: Zoek Gebruikers

source: Users - Your search returned
nl_nl: Gebruikers - Je zoekopdracht vindt

source: %n% User Result!
nl_nl: %n% Gebruiker Resultaat!

source: You are now logged in as member: %0%!
nl_nl: Je bent nu ingelogd als lid: %0%!

source: You are now logged out in as a member: %0%!
nl_nl: Je bent nu uitgelogd als lid: %0%!

source: The profile has been banned.
nl_nl: Het profiel is thans niet toegestaan.

source: Oops! An error has occurred while banishment the profile.
nl_nl: Ohoh! Een fout is opgetreden tijdens het verbieden van een profiel.

source: The profile has been unbanned.
nl_nl: Het profiel is weer toegestaan.

source: Oops! An error has occurred while unban the profile.
nl_nl: Ohoh! Een fout is opgetreden tijdens het ongedaan maken van een verboden profiel.

source: The profile has been deleted.
nl_nl: Het profiel is verwijderd.

source: The profile(s) has been banned.
nl_nl: De profiel(en) zijn niet toegestaan

source: The profile(s) has been unbanned.
nl_nl: De profiel(en) zijn weer toegestaan.

source: The profile(s) has been deleted.
nl_nl: De profielen zijn verwijderd.

source: General Settings
nl_nl: Algemene Instellingen

source: Advertisement Settings
nl_nl: Advertentie instellingen

source: Set Advertisement
nl_nl: Advertentie Instellen

source: Style code injection
nl_nl: Stijl code injectie

source: JavaScript code injection
nl_nl: JavaScript code injectie

source: Meta Tags - Settings
nl_nl: Meta Tags - Instellingen

source: Edit your account
nl_nl: Bewerk je account

source: %software_name% Information
nl_nl: %software_name% Informatie

source: Browse Admins
nl_nl: Blader door Beheerders

source: %n% Admin
nl_nl: %n% Beheerder

source: Search Admin - Looking an Admin
nl_nl: Zoek Beheerder - Kijken naar Beheerder

source: Add an Admin
nl_nl: Toevoegen Beheerder

source: The admin has been deleted.
nl_nl: De beheerder is verwijderd.

source: The admin(s) has been deleted.
nl_nl: De beheerder(s) zijn verwijderd.

source: Moderation Panel
nl_nl: Moderatie Paneel

source: Albums Picture Moderation
nl_nl: Albums Afbeeldingen Moderatie

source: Pictures Moderation
nl_nl: Foto's moderatie

source: Albums Video Moderation
nl_nl: Albums Video Moderatie

source: Videos Moderation
nl_nl: Videos Moderatie

source: Avatar Moderation
nl_nl: Avatar Moderatie

source: Profile Background Moderation
nl_nl: Gebruikers Achtergrond Profiel Moderatie

source: Welcome to the Picture Webcam in "administrator mode"
nl_nl: Welkom bij de foto Webcam in "administrator mode"

source: The picture album has been approved!
nl_nl: Het foto album is goedgekeurd!

source: Oops! The picture album could not be approved!
nl_nl: Ohoh! het foto album kon niet worden goedgekeurd!

source: The picture has been approved!
nl_nl: De foto is goedgekeurd!

source: Oops! The picture could not be approved!
nl_nl: Oops! De foto kan niet worden goedgekeurd!

source: The video album has been approved!
nl_nl: De video album is goedgekeurd!

source: Oops! The video album could not be approved!
nl_nl: Oops! De video album kan niet worden goedgekeurd!

source: The video has been approved!
nl_nl: De video is goedgekeurd!

source: Oops! The video could not be approved!
nl_nl: Oops! De video kan niet worden goedgekeurd!

source: The avatar has been approved!
nl_nl: De avatar is goedgekeurd!

source: Oops! The avatar could not be approved!
nl_nl: Oops! De avatar kan niet worden goedgekeurd!

source: The wallpaper has been approved!
nl_nl: De achtergrond is goedgekeurd!

source: Oops! The wallpaper could not be approved!
nl_nl: Oops! De achtergrond kan niet worden goedgekeurd!

source: The picture album has been disapproved!
nl_nl: De foto album is thans afgekeurd!

source: Oops! The picture album could not be disapproved!
nl_nl: Sorry! De foto album mocht niet worden afgekeurd!

source: The picture has been disapproved!
nl_nl: De foto is thans afgekeurd!

source: Oops! The picture could not be disapproved!
nl_nl: Sorry! De foto mocht niet worden afgekeurd!

source: The video album has been disapproved!
nl_nl: De video album is thans afgekeurd!

source: Oops! The video album could not be disapproved!
nl_nl: Sorry! De video album mocht niet worden afgekeurd!

source: The video has been disapproved!
nl_nl: De video is thans afgekeurd!

source: Oops! The video could not be disapproved!
nl_nl: Sorry! De video mocht niet worden afgekeurd!

source: The avatar has been disapproved!
nl_nl: De avatar is thans afgekeurd!

source: Oops! The avatar could not be disapprove!
nl_nl: Sorry! De avatar mocht niet worden afgekeurd!

source: The wallpaper has been disapproved!
nl_nl: De achtergrond is thans afgekeurd!

source: Oops! The wallpaper could not be disapprove!
nl_nl: Sorry! De achtergrond mocht niet worden afgekeurd!

source: The picture album has been deleted!
nl_nl: De foto album is verwijderd!

source: Oops! The picture album could not be deleted
nl_nl: Ohoh! De foto album kon niet worden verwijderd!

source: The picture has been deleted!
nl_nl: De foto is verwijderd!

source: Oops! The picture could not be deleted!
nl_nl: Ohoh! De foto kon niet worden verwijderd!

source: The video album has been deleted!
nl_nl: De video album is verwijderd!

source: Oops! The video album could not be deleted
nl_nl: Ohoh! De video album kon niet worden verwijderd!

source: The video has been deleted!
nl_nl: De video is verwijderd!

source: Oops! The video could not be deleted!
nl_nl: Ohoh! De video kon niet worden verwijderd!

source: Module Manager
nl_nl: Module Beheer

source: Caches Management
nl_nl: Cache Beheer

source: Database and other data
nl_nl: Database en andere data

source: Compile template
nl_nl: Compileer template

source: Static files
nl_nl: Statische bestanden

source: Cache Settings
nl_nl: Cache Instellingen

source: Free Space of Server
nl_nl: Vrije Ruimte op de Server

source: Public Root
nl_nl: Publieke Root

source: Public data
nl_nl: Publieke Data

source: Protected Root
nl_nl: Beveiligde Root

source: Protected data
nl_nl: Beveiligde Data

source: Backup Management
nl_nl: Backup Beheer

source: Data successfully dumped into file "%0%"
nl_nl: Data met succes opgeslagen in bestand "%0%"

source: Please select a field.
nl_nl: Selecteer aub een veld.

source: Please select a dump file.
nl_nl: Selecteer aub een data bestand.

source: Data successfully restored from server!
nl_nl: Data met succes hersteld van server!

source: Dump file successfully deleted!
nl_nl: Data bestand met succes verwijderd!

source: Please select a dump SQL file.
nl_nl: Selecteer aub een data SQL bestand.

source: Data successfully restored from desktop!
nl_nl: Data met succes hersteld van desktop!

source: All tables have been optimized!
nl_nl: Alle tabellen zijn geoptimaliseerd!

source: All tables have been repaired!
nl_nl: Alle tabellen zijn gerepareerd!

source: Protected
nl_nl: Beveiligd

source: Public
nl_nl: Publiek

source: File Manager System | %0%
nl_nl: Bestand Beheer Systeem | %0%

source: Template Files
nl_nl: Template Bestanden

source: Email Templates
nl_nl: Template Email

source: Ban Files
nl_nl: Verbied Bestanden

source: Suggestion Files
nl_nl: Bestanden Suggestie

source: Pages
nl_nl: Pagina's

source: Public Files
nl_nl: Publieke Bestanden

source: Edit Public Files
nl_nl: Bewerk Publieke Bestanden

source: Protected Files
nl_nl: Beveiligde bestanden

source: Edit Protected Files
nl_nl: Bewerk Beveiligde Bestanden

source: File Management
nl_nl: Bestanden Beheer

source: The cache has been deleted!
nl_nl: De cache is verwijderd!

source: The Advertisement we been activate.
nl_nl: De Advertentie die is geactiveerd.

source: Cannot activate Advertisement, please try later.
nl_nl: Kan de Advertentie niet activeren, probeer het aub later nog eens.

source: The deactivate we been deleted.
nl_nl: De gedeactiveerde die is verwijderd.

source: Cannot deactivate Advertisement, please try later.
nl_nl: Kan de Advertentie niet deactiveren, Probeer het aub later nog eens.

source: The Advertisement we been deleted.
nl_nl: De Advertentie die we hebben verwijderd.

source: Cannot remove Advertisement, please try later.
nl_nl: Kan de Advertentie niet verwijderen, probeer aub later opnieuw.

source: Unable to execute the query SQL of module.<br />Error Message: %0%
nl_nl: Niet mogelijk om het verzoek uit te voeren op de SQL van de module.<br />Error Message: %0%

source: Match Sex:
nl_nl: Gelijk Geslacht:

source: File Content
nl_nl: Inhoud Bestand

source: Return to back admins browse
nl_nl: Terug bladeren voor beheerders

source: Search for:
nl_nl: Zoeken naar:

source: All
nl_nl: Alles

source: IP Address
nl_nl: IP Adres

source: Only banned user
nl_nl: Alleen geweigerde gebruiker

source: Your custon CSS code
nl_nl: Je aangepaste CSS code

source: Title:
nl_nl: Titel:

source: The predefined variable for the URL of an affiliate account to put in the HTML is: %0%.
nl_nl: De vooraf gedefinieerde variabele voor de URL van een affiliate account om in de HTML te zetten is:% 0%.

source: The predefined variable to the URL of your site to indicate this in the HTML is: %0%.
nl_nl: De vooraf gedefinieerde variabele naar de URL van je site om dit aan te geven in de HTML is:% 0%.

source: Import members into your site from a <strong><abbr title="Comma Separated Values">CSV</abbr></strong> file. You can find database users <strong><a href="%0%">here</a></strong>.
nl_nl: Importeer leden in je site vannuit een <strong><abbr title="Comma Separated Values">CSV</abbr></strong> bestand. Je vindt database gebruikers <strong><a href="%0%">hier</a></strong>.

source: CSV file:
nl_nl: CSV bestand:

source: Delimiter:
nl_nl: Scheidingsteken:

source: Enclosure:
nl_nl: Ingesloten:

source: Your custon JavaScript code
nl_nl: Je aangepaste JavaScript code

source: Global Settings:
nl_nl: Basis Instellingen:

source: Site Name:
nl_nl: Site Naam:

source: Theme by default:
nl_nl: Thema Standaard:

source: Language by default:
nl_nl: Taal Standaard:

source: Map Type:
nl_nl: Kaart Soort:

source: Roadmap (default)
nl_nl: Wegenkaart (standaard)

source: Hybrid
nl_nl: Hybride

source: Terrain
nl_nl: Terrein

source: Satellite
nl_nl: Satelliet

source: Use the Splash Page for the visitors, otherwise it will classic page that will be used.
nl_nl: Gebruik de Landings Pagina voor de bezoekers, anders wordt de klassieke pagina gebruikt.

source: Ajax Site with AjPH:
nl_nl: Ajax Site met AjPH:

source: Maintenance
nl_nl: Onderhoud

source: Show the News Feed:
nl_nl: Toon de News Feed:

source: The current logo of your site.
nl_nl: De huidige logo op je site.

source: Registration:
nl_nl: Registratie:

source: Account activation type for Members:
nl_nl: Account activatie soort voor Leden:

source: No activation required
nl_nl: Geen activatie vereist

source: Self activation via email
nl_nl: Zelf activatie via email

source: Manual activation by administrator
nl_nl: Handmatige activatie door beheerder

source: Account activation type for Affiliates:
nl_nl: Account activatie door Affiliates:

source: Minimum username length:
nl_nl: Minimale lengte gebruikersnaam:

source: Maximum username length:
nl_nl: Maximale lengte gebruikersnaam:

source: Minimum age for registration:
nl_nl: Minimum leeftijd voor registratie:

source: Maximum age for registration:
nl_nl: Maximum leeftijd voor registratie:

source: Default Membership Group:
nl_nl: Standaard Lidmaatschap van Groep:

source: Picture and Video:
nl_nl: Afbeelding en Video:

source: Image:
nl_nl: Foto:

source: Watermark text:
nl_nl: Watermerk Tekst:

source: Size Watermark Text:
nl_nl: Formaat Watermerk Tekst:

source: Between 0 to 5.
nl_nl: Tussen 0 to 5.

source: Default video:
nl_nl: Standaard video:

source: Video by default if no video found.
nl_nl: Standaard Video als er geen video gevonden wordt.

source: Autoplay Video:
nl_nl: Autostart Video:

source: Moderation:
nl_nl: Moderatie:

source: Profile Background Manual Approval:
nl_nl: Handmatige Goedkeuring Profiel-Achtergrond:

source: Note Post Manual Approval:
nl_nl: Handmatige Goedkeuring Note Post:

source: Pictures Manual Approval:
nl_nl: Handmatige Goedkeuring Afbeeldingen:

source: Videos Manual Approval:
nl_nl: Handmatige Goedkeuring Video's:

source: Webcam Pictures Manual Approval:
nl_nl: Handmatige Goedkeuring Webcam-Afbeeldingen:

source: This mode is experimental approval, do not use it in production.
nl_nl: Deze modus is experimentele goedkeuring. Gebruik het niet actief.

source: Email Name:
nl_nl: Email Naam:

source: Admin Email:
nl_nl: Email Beheerder:

source: Feedback Email:
nl_nl: Email Feedback:

source: Return Email:
nl_nl: Email Terugkopeling:

source: Security:
nl_nl: Veiligheid:

source: Minimum password length:
nl_nl: Minimale lengte wachtwoord:

source: Maximum password length:
nl_nl: Maximale lengte wachtwoord:

source: Blocking login attempts exceeded:
nl_nl: Inlogpogingen blokkeren bij:

source: Enable blocking for User:
nl_nl: Zet blokkering aan voor Gebruiker:

source: Enable blocking for Affiliate:
nl_nl: Zet blokkering aan voor Affiliate:

source: Enable blocking for Admin:
nl_nl: Zet blokkering aan voor Beheerder:

source: Max login attempts before blocking for User:
nl_nl: Maximale login pogingen voor blokkering voor Gebruiker:

source: Max login attempts before blocking for Affiliate:
nl_nl: Maximale login pogingen voor blokkering voor Affiliate:

source: Max login attempts before blocking for Admin:
nl_nl: Maximale login pogingen voor blokkering voor Beheerder:

source: Time interval blocking for User:
nl_nl: Tijd interval blokkering voor Gebruiker:

source: Time in minutes.
nl_nl: Tijd in minuten:

source: Time interval blocking for Affiliate:
nl_nl: Tijd interval blokkering voor Affiliate:

source: Time interval blocking for Admin:
nl_nl: Tijd interval blokkering voor Beheerder:

source: Various:
nl_nl: Diverse(n)

source: Activate
nl_nl: Activeer

source: Deactivate
nl_nl: Deactiveer

source: Enter <a href="%0%" title="Get your IP here!">your IP address</a> and an even higher security and exclude all other persons and bots that tried to connect with another IP address even if the login is correct! Leave blank to disable this feature.
nl_nl: Geef <a href="%0%" title="Get your IP here!">je IP adres</a>in, en zelfs derden met hogere rechten of derden met de logingegevens worden geweigerd. Alleen jou IP adres heeft toegang. Leeg laten om deze optie niet te gebruiken..

source: Indicate a word that will replace the banned word in the <a href="%0%">list</a>.
nl_nl: Geeft het woord aan dat op de plaats komt van de <a href="%0%">lijst</a> van verbannen woorden.

source: CSRF token lifetime:
nl_nl: CSRF tekens levensduur:

source: Time in seconds.
nl_nl: Tijd in seconden.

source: System against the DDoS attacks:
nl_nl: Systeem tegen de DDos aanvallen:

source: Time Delay:
nl_nl: Vertraging:

source: Registration delay for User
nl_nl: Vertraging voor Gebruiker bij registratie

source: Number of minutes for a new registration with the same IP address.
nl_nl: Aantal minuten tot tijdstip nieuwe registratie vanaf hetzelfde IP adres.

source: Registration delay for Affiliate
nl_nl: Vertraging voor Affiliate bij registratie

source: Send Note delay
nl_nl: Verstuur Note vertraging

source: Number of minutes for the same user to post a new note.
nl_nl: Aantal minuten tot tijdstip plaatsen een nieuwe note door gebruiker

source: Send Mail delay
nl_nl: Verstuur Mail vertraging

source: Number of minutes for the same user can send a new email.
nl_nl: Aantal minuten tot tijdstip dat gebruiker een nieuwe email kan versturen.

source: Send Comment delay
nl_nl: Verstuur Commentaar vertraging

source: Number of minutes for the same user can send a new comment.
nl_nl: Aantal minuten voor dezelfde gebruiker, voordat deze een nieuwe reactie kan geven.

source: Send Forum Topic delay
nl_nl: Verstuur Forum Topic vertraging

source: Number of minutes for the same user can send a new topic in the forum.
nl_nl: Aantal minuten voor dezelfde gebruiker, voordat deze een een nieuwe topic kan starten op het forum.

source: Send Forum Message delay
nl_nl: Verstuur Forum Bericht vertraging

source: Number of minutes for the same user can send a reply message in the same topic.
nl_nl: Aantal minuten voor dezelfde gebruiker, voordat deze een antwoord kan geven op een bericht in dezelfde topic.

source: Captcha for User Signup Form:
nl_nl: Captcha voor Gebruikers Aanmeld Formulier:

source: Captcha for Affiliate Signup Form:
nl_nl: Captcha voor Affiliate Aanmeld Formulier:

source: Captcha for send an Email:
nl_nl: Captcha om een email te sturen:

source: Captcha for adding a Comment:
nl_nl: Captcha om commentaar te geven:

source: Captcha for adding or reply a message in the Forum:
nl_nl: Captcha voor het toevoegen van een antwoord op een bericht in het forum:

source: Captcha for adding a User Post Note:
nl_nl: Captcha voor het toevoegen van een User Post Note:

source: Pruning:
nl_nl: Opschonen:

source: The URL must end with a slash.
nl_nl: De URL moet eindigen met een slash.

source: Parsing tags are permitted (e.g. #!http://api.your-service-chat.com/?url=%0%&name=%1%!#).
nl_nl: Parsing labels zijn toegestaan (bijvoorbeeld #!http://api.your-service-chat.com/?url=%0%&name=%1%!#).

source: Automation:
nl_nl: Automatisch:

source: User inactivity timeout:
nl_nl: Timeout bij inactiviteit Gebruiker:

source: The number of minutes that a member becomes inactive (offline).
nl_nl: Aantal minuten dat een lid op inactief wordt gezet (offline).

source: Advertisement:
nl_nl: Advertentie:

source: Delete
nl_nl: Verwijder

source: With your time zone, the other administrators may know when they can contact you easily.
nl_nl: Met jouw tijdzone kan de beheerder zien wanner hij het beste eventueel contact met je op kan nemen.

source: Click here to show/hide the languages
nl_nl: Klik hier om talen te zien/verbergen

source: Change language for the Meta Tags
nl_nl: Kies de taal voor de Meta Tags

source: Language:
nl_nl: Taal:

source: Home page title:
nl_nl: Home page titel:

source: Category (meta tag):
nl_nl: Distribution (meta tag):

source: Your code analytics (e.g., Google Analytics)
nl_nl: Je analyse code (bijvoorbeeld, Google Analytics)

source: Search an Admin:
nl_nl: Zoek een Beheerder:

source: Enter their ID, First Name, Last Name, Username, Email, Sex or IP address.
nl_nl: Voer hun ID, Voornaam, Achternaam, Gebruikersnaam, Email, Geslacht of IP adres in.

source: Latest Admins
nl_nl: Laatste Beheerders

source: Incorrect Login!
nl_nl: Login Onjuist!

source: The minimum length of the username cannot exceed %0% characters.
nl_nl: De minimum lengte van de gebruikersnaam mag niet kleiner zijn dan %0% karakters.

source: The maximum length of the username cannot exceed %0% characters.
nl_nl: De maximum lengte van de gebruikersnaam mag niet groter zijn dan %0% karakters.

source: You cannot specify a minimum age higher than the maximum age.
nl_nl: Je kan geen minimum leeftijd ingeven die hoger is als de maximum leeftijd.

source: The token lifetime cannot be below 10 seconds.
nl_nl: De identificatiesleutel levensduur kan niet lager zijn als 10 seconden.

source: The configuration was saved successfully!
nl_nl: De configuratie is met succes opgeslagen!

source: The user has been successfully added.
nl_nl: De gebruiker is met succes toegevoegd.

source: The Advertisements was saved successfully!
nl_nl: De Advertentie is met succes opgeslagen!

source: The Meta Tags was saved successfully!
nl_nl: De Meta Tags zijn met succes opgeslagen!

source: Your JS code was saved successfully!
nl_nl: Je JS code is met succes opgeslagen!

source: The file content was saved successfully!
nl_nl: het bestand is met succes opgeslagen!

source: Your CSS code was saved successfully!
nl_nl: Je CSS code is met succes opgeslagen!

source: The administrator has been successfully added.
nl_nl: De beheerder is met succes toegevoegd.

source: The code Analytics Api was saved successfully!
nl_nl: De code Analytics Api is met succes opgeslagen!

source: Invalid email address or this email is already used by another admin.
nl_nl: Ongeldig email adres of dit email adres is al in gebruik door een andere beheerder.

source: Oops! You are already logged in as administrator.
nl_nl: Ohoh! Je bent al als beheerder ingelogd!

source: This module is a test for create simple module
nl_nl: Deze module is een test om simpel een module te maken

source: hello world, test, developpers, CMS, Dating CMS, CMS Dating, Social CMS, pH7, pH7 CMS, Dating Script, Social Dating Script, Dating Software, Social Network Software, Social Networking Software
nl_nl: hello world, test, ontwikkelaars, CMS, Dating CMS, CMS Dating, Social CMS, pH7, pH7 CMS, Dating Script, Social Dating Script, Dating Software, Social Network Software, Social Networking Software

source: Example of simple module that displays hello world for the CMS
nl_nl: Voorbeeld van een simpele module dat hello world toont voor het CMS

source: H3 title example
nl_nl: H3 titel voorbeeld

source: Hello world %0% %1%, how are you on %2%?
nl_nl: Hello world %0% %1%, hoe gaat het met je op %2%?

source: HTTP Secure Page
nl_nl: HTTP Veilige Pagina

source: Simple HTTP Secure Page
nl_nl: Eenvoudige HTTP Veilige Pagina

source: secure,CMS,PHP,framework,MVC,page,HTTP
nl_nl: beveiligde,CMS,PHP,framework.MVC,page,HTTP

source: About %site_name%
nl_nl: Over %site_name%

source: About Us
nl_nl: Over Ons

source: Our Blog
nl_nl: Onze Blog

source: Become an Affiliate
nl_nl: Wordt een Affiliate

source: Contact us
nl_nl: Contacteer ons

source: Our Partners
nl_nl: Onze Partners

source: Jobs | Careers
nl_nl: Beroep | Carriëre

source: Jobs
nl_nl: Beroep

source: Our Team
nl_nl: Ons Team

source: About
nl_nl: Over

source: Terms of Use
nl_nl: Gebruiksvoorwaarden

source: Subscribe to our newsletter!
nl_nl: Abonneer u op onze nieuwsbrief!

source: Invite
nl_nl: uitnodigen

source: WARNING: Your site is in development mode!
nl_nl: WAARSCHUWING: Je site is in de ontwikkel modus!

source: Join Now!
nl_nl: Meld je Nu aan!

source: Members
nl_nl: Leden

source: People
nl_nl: Mensen

source: Search the members
nl_nl: Doorzoek de leden

source: Quick Search
nl_nl: Snel zoeken

source: Advanced Search
nl_nl: Geavanceerd Zoeken

source: Users Birthday
nl_nl: Verjaardag Gebruikers

source: Birthday
nl_nl: Verjaardag

source: All Birthday
nl_nl: Alle Verjaardagen

source: Men Birthday
nl_nl: Verjaardagen Mannen

source: Women Birthday
nl_nl: Verjaardagen Vrouwen

source: Couples Birthday
nl_nl: Verjaardagen Stellen

source: The Free Chat Rooms
nl_nl: De Gratis Chat Rooms

source: Photo Gallery
nl_nl: Foto Gallerij

source: Picture
nl_nl: Foto

source: Pictures
nl_nl: Foto's

source: Search a Picture
nl_nl: Zoek een Foto

source: Video Gallery
nl_nl: Video Gallerij

source: Search a Video
nl_nl: Zoek een Video

source: Search a Game
nl_nl: Zoek een Game

source: Search a Topic
nl_nl: Zoek een Topic

source: Community Notes
nl_nl: Community Artikelen

source: Notes
nl_nl: Artikelen

source: Search a Note
nl_nl: Zoek een Artikel

source: My Emails
nl_nl: Mijn emails

source: Compose
nl_nl: Samenstellen

source: Settings
nl_nl: Instellingen

source: Edit Profile
nl_nl: Bewerk Profiel

source: Design Profile
nl_nl: Ontwerp Profiel

source: Privacy Setting
nl_nl: Privacy Instellingen

source: My account
nl_nl: Mijn account

source: My settings
nl_nl: Mijn instellingen
