Repository: pH7Software/pH7-Social-Dating-CMS
Catalog: _protected/app/langs/*/LC_MESSAGES/global.po
Languages: nl_nl

source: Help US - %site_name%
nl_nl: Help Ons - %site_name%

source: Share this site with others!
nl_nl: Deel deze site met anderen!

source: Do you like %site_name% and want it even more popular, then share this site on your website, blog, discussion forum, etc...
nl_nl: Vindt je %site_name% leuk en wil je dat het groeit ? Deel deze site dan op je website, blog, forum, Facebook, Twitter, etc...

source: Partners of %site_name%
nl_nl: Partners van %site_name%

source: Jobs - Careers @ %site_name%
nl_nl: Vacatures - Mogelijkheden @ %site_name%

source: Careers, Jobs and Internships at %site_name%
nl_nl: Mogelijkheden, Vacatures en Stages op %site_name%

source: Links and Partners of %site_name%
nl_nl: Links en Partners van %site_name%

source: Invite your friends to join %site_name%
nl_nl: Nodig je vrienden om mee te doen op %site_name%

source: Your name:
nl_nl: Je naam:

source: To:
nl_nl: Aan:

source: Upto 10 email addresses separated by commas.
nl_nl: Maximaal 10 email adressen gescheiden door komma's.

source: Message:
nl_nl: Bericht:

source: Invite your friends!
nl_nl: Nodig je vrienden uit!

source: One or more email addresses are invalid!
nl_nl: Eén of meerdere email adressen zijn ongeldig!

source: Get exclusive privilege to join your friend is waiting for you!
nl_nl: Krijg exclusieve privileges om je vriend gezelschap te houden. Je wordt nu verwacht!

source: Message left by your friend:
nl_nl: Bericht achtergelaten door je vriend:

source: You are receiving this message because "%0%" you know has entered your email address in the form of invitation of friends to our site. This is not spam!
nl_nl: Je ontvangt dit bericht omdat "%0%" die je kent, jou heeft ingevuld op het uitnodigingsformulier op onze site. Dit is geen spam!

source: Privilege on the invitation from your friend for the new generation community platform - %site_name%
nl_nl: Privilege op uitnodiging van je vriend voor de nieuwe generatie community platform - %site_name%

source: Free Video Room, Live Speed Dating ChatRoulette
nl_nl: Gratis Video Room, Live Speed Dating ChatRoulette

source: Free Live Speed Dating with the Chatroulette of %site_name%, Meet new people near you and make new friends, sex friends and free flirting, Free online dating site for singles without registration with Video Chat Rooms!
nl_nl: Gratis Live Speed Dating met de Chatroulette van %site_name%,Ontmoet nieuwe mensen bij je in de buurt, sex maatjes en gratis flirten, Gratis online dating site voor alleenstaande zonder registratie met Video Chat Rooms!

source: chat, chatroulette, sex friend, single, speed dating, meet singles, dating, free dating, chat room, chat webcam
nl_nl: chat, chatroulette, sex maatje, alleenstaande, speed dating, ontmoet alleenstaande, dating, gratis dating, chat room, chat webcam

source: Welcome to <span class="pH1">Speed Dating ChatRoulette</span> of <span class="pH0">%site_name%</span>!
nl_nl: Welkom bij de <span class="pH1">Speed Dating ChatRoulette</span> van <span class="pH0">%site_name%</span>!

source: Become an Affiliate with the affiliate dating community platform %site_name%
nl_nl: Wordt een Affiliate met de affiliate dating community platform %site_name%

source: affiliate,dating,dating site,social network,pay per click affiliate program, affiliate program
nl_nl: affiliate,dating,dating site,social network,pay per click affiliate programma, affiliate programma

source: Affiliate Platform with %site_name%! Dating Social Affiliate
nl_nl: Affiliate Platform met %site_name%! Dating Social Affiliate

source: Hello <em>%0%</em>, welcome to your site!
nl_nl: Hallo <em>%0%</em>, welkom op je site!

source: Login Affiliate
nl_nl: Affiliate Login

source: Resend activation email
nl_nl: Opnieuw activatie email verzonden

source: Edit your profile
nl_nl: Bewerk je profiel

source: Change Password
nl_nl: Verander Wachtwoord

source: Delete Affiliate Account
nl_nl: Verwijder Affliliate Account

source: WARNING: If you delete your account you will not receive your money.
nl_nl: WAARSCHUWING: Als je dit account verwijderd ontvang je geen geld meer.

source: Are you really sure you want to delete your account?
nl_nl: Weet je zeker dat je wilt stoppen en je account verwijderen?

source: No I changed my mind and I stay with you!
nl_nl: Nee, ik ben van gedachte veranderd en ik blijf bij jullie!

source: Yes I really want to delete my account
nl_nl: Ja, helaas ik wil mijn account verwijderen

source: Welcome to the administration of Ad Affiliate
nl_nl: Welkom bij de administratie van de Advertentie Affiliate

source: Browse Affiliates
nl_nl: Affiliates Doorbladeren

source: Search Affiliate - Looking a new Affiliate
nl_nl: Affiliate Zoeken - Zoeken naar een nieuwe Affiliate

source: Add an Affiliate
nl_nl: Affiliate Toevoegen

source: You are now logged in as affiliate: %0%!
nl_nl: Je bent nu ingelogd als affiliate: %0%!

source: You are now logged out in as an affiliate: %0%!
nl_nl: Je bent nu uitgelogd als affiliate: %0%!

source: The affiliate has been banned.
nl_nl: De affiliate is verbannen.

source: Oops! An error has occurred while banishment the affiliate.
nl_nl: Ohoh! Een fout is opgetreden tijdens het verbannen van een affiliate.

source: The affiliate has been unbanned.
nl_nl: De affiliate verbanning is ongedaan gemaakt.

source: Oops! An error has occurred while unban the affiliate.
nl_nl: Ohoh! Er is een fout opgetreden tijdens het ongedaan maken van de verbanning.

source: The affiliate has been deleted.
nl_nl: De affiliate is verwijderd.

source: The affiliate(s) has been banned.
nl_nl: De affiliate(s) zijn verbannen.

source: The affiliate(s) has been unbanned.
nl_nl: De affiliate(s) verbanning is ongedaan gemaakt.

source: The affiliate(s) has been deleted.
nl_nl: De affiliate(s) zijn verwijderd.

source: Your membership account has been declined
nl_nl: Je lidmaatschap account is thans geweigerd

source: Sorry, Your membership account has been declined.
nl_nl: Sorry, Je lidmaatschap account is thans geweigerd

source: Your membership account has been activated
nl_nl: Je lidmaatschap account is geactiveerd

source: Congratulations! Your account has been approved by our team of administrators.<br />You can now %0% to meeting new people!
nl_nl: Gefeliciteerd! Je account is goedgekeurd door het team van beheerders.<br />Je kan nu %0% om nieuwe mensen te ontmoeten!

source: Dear %0%,
nl_nl: Beste %0%,

source: Error! Bad argument in the url.
nl_nl: Fout! Slechte argument in de url.

source: The user is not found!
nl_nl: De gebruiker is niet gevonden!

source: Error! Missing argument in the url.
nl_nl: Fout! Mist een argument in de url.

source: Signup Account | Affiliate - %site_name%
nl_nl: Aanmelden Account | Affiliate - %site_name%

source: Please %0% now to make money!
nl_nl: AUB %0% om geld te verdienen!

source: Dear %0% %1%, welcome to affiliate platform %site_name%!
nl_nl: Beste %0% %1%, welkom op het affiliate platform van %site_name%!

source: Hello %0%! We are proud to welcome you as an affiliate on our %site_name%!
nl_nl: Hallo %0%! We zijn er trots op om je te mogen verwelkomen als een affiliate op %site_name%!

source: Dear %0% %1%, Welcome to our affiliate platform!
nl_nl: Beste %0% %1%, Welkom op ons affiliate platform!

source: Preview Banner:
nl_nl: Banner Voorvertoning:

source: Search an Affiliate:
nl_nl: Zoek een Affliliate:

source: Enter their ID, First Name, Last Name, Username, Email, Bank Account, Sex or IP address.
nl_nl: Geef hun ID, Voornaam, Achternaam, Gebruikersnaam, Email, Bankrekening, Geslacht of IP adres.

source: Pending approval
nl_nl: Afwachting goedkeuring

source: Latest
nl_nl: Laatste

source: Last Account Edit
nl_nl: Laatste account bewerking

source: Back to Browse Affiliates
nl_nl: Terug naar Bladeren Affiliates

source: Global Information:
nl_nl: Globale Informatie:

source: Attention all your information must be complete, candid and valid.
nl_nl: Attentie, alle informatie moet compleet, geldig en naar waarheid zijn.

source: Username:
nl_nl: Gebruikersnaam:

source: For site security, you cannot change your username.
nl_nl: Voor de veiligheid van de site kan je de gekozen gebruikersnaam niet veranderen.

source: For site security and to avoid spam, you cannot change your email address.
nl_nl: Wegens veiligheidsoverwegingen en om spam tegen te gaan, kan je niet je email adres wijzigen.

source: Your Sex:
nl_nl: Je Geslacht:

source: Female
nl_nl: Vrouw

source: Your Date of birth:
nl_nl: Je Geboortedatum:

source: Your username will be your unique ID reference for advertisements.
nl_nl: Je gerbuikersnaam is je unieke ID referentie voor advertenties.

source: Your password. It will be used for logging in to the site. This storage is secure, because we are using an encrypted format.
nl_nl: Je wachtwoord. Het zal worden gebruikt om in te loggen op de site. De opslag is veilig, omdat we met versleuteling werken.

source: Please specify your gender.
nl_nl: Geef aub je geslacht in.

source: Month/Day/Year
nl_nl: Maand/Dag/Jaar

source: Please specify your birth date using the calendar or with this format: Month/Day/Year.
nl_nl: Specificeer je geboortedatum door de internationale kalender te gebruiken: Maand/Dag/Jaar.

source: Select the country where you live.
nl_nl: Selecteer het land waar je woont.

source: Specify the city where you live.
nl_nl: Specificeer de woonplaats waar je woont

source: Your State:
nl_nl: Je Provincie:

source: Specify your state.
nl_nl: Specificeer je Staat.

source: Your ZIP/Postal Code:
nl_nl: Je Postcode:

source: Enter your post code (Zip).
nl_nl: Geef je postcode in (ZIP).

source: Terms of Service
nl_nl: Gebruiksvoorwaarden

source: Advertisement
nl_nl: Advertentie

source: Return to back affiliates browse
nl_nl: Ga terug naar affliliates doorbladeren

source: Bank Information:
nl_nl: Bank Informatie:

source: Your Bank Account:
nl_nl: Je Bankrekening:

source: Your Bank Account (PayPal Email Address).
nl_nl: Je Bankrekening (bij PayPal het Email Adres).

source: Your Bank Account.
nl_nl: Je Bankrekening.

source: Password:
nl_nl: Wachtwoord:

source: First Name:
nl_nl: Voornaam:

source: Last Name:
nl_nl: Achternaam:

source: Sex:
nl_nl: Geslacht:

source: Date of birth:
nl_nl: Geboortedatum:

source: Please specify the birth date using the calendar or with this format: Month/Day/Year.
nl_nl: Specificeer aub het geboortedatum met gebruik van de kalender of met de wijze: Maand/Dag/Jaar.

source: State:
nl_nl: Provincie:

source: Phone Number:
nl_nl: Telefoonnummer:

source: Description:
nl_nl: Beschrijving:

source: Description of the affiliate's site(s).
nl_nl: Beschrijving van de affiliate's site(s).

source: Main website where the affiliate is the owner.
nl_nl: Hoofd website, waar de affiliate de eigenaar van is.

source: Bank Account:
nl_nl: Bankrekening:

source: Bank Account (PayPal Email Address).
nl_nl: Bankrekening (bij Paypal het Email Adres).

source: The affiliate has been successfully added.
nl_nl: De affiliate is met succes toegevoegd.

source: Oops! "%0%" is not associated with any %site_name% account.
nl_nl: Ohoh! "%0%" is niet gekoppeld met enig %site_name% account.

source: Your bank information has been saved successfully!
nl_nl: Je bank gegevens zijn met succes opgeslagen!

source: Your affiliate account has been created! %0%
nl_nl: Je affiliate account is aangemaakt! %0%

source: Your profile has been saved successfully!
nl_nl: Je profiel is met succes opgeslagen!

source: Password Reset
nl_nl: Wachtwoord Resetten

source: Oops! Email or hash is invalid.
nl_nl: Ohoh! Email of hash is ongeldig.

source: Your new password has been emailed to you.
nl_nl: Je nieuwe wachtwoord is onderweg via de mail.

source: Generate a new password!
nl_nl: Genereer een nieuw wachtwoord!

source: Successfully requested a new password, email sent!
nl_nl: Met succes een nieuw wachtwoord aangevraagd. De email is verstuurd!

source: If you requested for this, click on the link below, otherwise ignore this email and your password will remain unchanged.
nl_nl: Als je hierom hebt verzocht, klik dan op onderstaande link. Anders deze mail als niet verzonden beschouwen en het wachtwoord blijft ongewijzigd.

source: Request for new password - %site_name%
nl_nl: Verzoek om nieuw wachtwoord - %site_name%

source: For security reasons, you do not have the right to generate a new password. To disable this security option, you must go to the Permission file of "lost-password" module
nl_nl: Om veiligheidsredenen, heb je geen rechten om een nieuw wachtwoord te genereren. Om deze optie uit te schakelen moet naar de Bestands-Permissie van de "lost-password" module gaan.

source: See you soon!
nl_nl: Zie je snel!

source: Account Settings
nl_nl: Account Instellingen

source: Edit Your Profile
nl_nl: Bewerk Je Profiel

source: Photo of profile
nl_nl: Foto van Profiel

source: Change your Avatar
nl_nl: Verander je Avatar

source: Your Wallpaper
nl_nl: Je Achtergrond

source: Notifications
nl_nl: Meldingen

source: Privacy Settings
nl_nl: Privacy Instellingen

source: Delete Account
nl_nl: Verwijder Account

source: Your avatar has been deleted successfully!
nl_nl: Je avatar is met succes verwijderd!

source: Your wallpaper has been deleted successfully!
nl_nl: Je achtergrond is met succes verwijderd!

source: Friend:
nl_nl: Vriend:

source: No Friends
nl_nl: Geen Vrienden

source: Friends:
nl_nl: Vrienden:

source: Mutual Friend:
nl_nl: Gezamelijke Vrienden:

source: No Mutual Friends
nl_nl: Geen Gezamelijke Vrienden:

source: Mutuals Friends:
nl_nl: Gezamelijke Vrienden:

source: You need to free register for send a message to %0%.
nl_nl: Je moet je gratis registreren om een bericht te sturen aan %0%.

source: You need to free register for talk to %0%.
nl_nl: Je moet je gratis registreren om te kunnen praten met %0%.

source: Free Sign up for %site_name% to become friend with %0%.
nl_nl: Schrijf je Gratis in op %site_name% en wordt vrienden met %0%.

source: Meet %0%, A beautiful %1% looking some %2% - %3% years - %4% - %5% %6%
nl_nl: Ontmoet %0%, Een %1% zoekt naar %2% - %3% jaar - %4% - %5% %6%

source: Meet %0% %1% | %2% - %3%
nl_nl: Ontmoet %0% %1% | %2% - %3%

source: Meet <span class="pH1">%0%</span> on <span class="pH0">%site_name%</span>
nl_nl: Ontmoet <span class="pH1">%0%</span> op <span class="pH0">%site_name%</span>

source: A <span class="pH1">%0%</span> of <span class="pH3">%1% years</span>, from <span class="pH2">%2%, %3% %4%</span>
nl_nl: Een <span class="pH1">%0%</span> van <span class="pH3">%1% jaar</span>, uit <span class="pH2">%2%, %3% %4%</span>

source: Meet %0% near here!
nl_nl: Ontmoet %0% in de buurt!

source: Whoops! The "%0%" profile is only visible to members. Please <a href="%1%">login</a> or <a href="%2%">register</a> to see this profile.
nl_nl: Ohoh! Het profiel van "%0%" is alleen zichtbaar voor leden. Klik op <a href="%1%">login</a> of <a href="%2%">registreer</a> om het profiel te zien.

source: Whoops! The "%0%" profile is not available to you.
nl_nl: Ohoh! Het profiel van "%0%" is niet in te zien voor je.

source: Whoops! The "%0%" profile is not found.
nl_nl: Ohoh! Het profiel van "%0%" is niet gevonden.

source: Users Birthday %0%
nl_nl: Gebruikers Verjaardag %0%

source: birthday,birthdate,anniversary,birth,friend,dating,social networking,profile,social
nl_nl: verjaardag,geboortedatum,geboren,vriend,dating,social networking,profiel,social

source: Users Birthday (<span class="pH3">%0%</span>)
nl_nl: Gebruikers Verjaardag (<span class="pH3">%0%</span>)

source: visitor,friend,dating,social networking,visitors,spy,profile,social,%0%
nl_nl: bezoeker,vriend,vriendin,dating,daten,social networking,bezoekers,spion,profiel,social,%0%

source: %0%'s Visitors:
nl_nl: %0%'s Bezoekers:

source: %n% Visitor
nl_nl: %n% Bezoeker

source: Search Quick Profiles
nl_nl: Snelzoeken door Profielen

source: The Search Members | Quick Search
nl_nl: Leden Zoeken | Snel Zoeken

source: Search Advanced Profiles
nl_nl: Geavanceerd Leden Zoeken

source: The Search Members | Advanced Search
nl_nl: Leden Zoeken | Geavanceerd Zoeken

source: Empty search result. Please try again with wider or new search parameters.
nl_nl: Leeg zoek resultaat. Probeer opnieuw met andere trefwoorden of parameters.

source: Browse Members
nl_nl: Leden Doorbladeren

source: Meet new People with %0%
nl_nl: Ontmoet Nieuwe Mensen met %0%

source: Meet new People and Friends near you with %site_name% - Browse Members
nl_nl: Ontmoet nieuwe Mensen en Vrienden bij je in de buurt met %site_name% - Leden Doorbladeren

source: Hello <em>%0%</em>, welcome to %site_name%!
nl_nl: Hallo <em>%0%</em>, welkom op %site_name%!

source: How are you today?
nl_nl: hoe gaat het vandaag met je?

source: Meet new people here!
nl_nl: Ontmoet hier nieuwe mensen!

source: Free online dating in %0% %1%, meet people, find friends. Single men & women in %2% %3%
nl_nl: Gratis online dating in %0% %1%, ontmoet mensen, vindt vrienden. Alleenstaande mannen & vrouwen in %2% %3%

source: Free online dating in %0% with single women & men. Personals, meet people & find friends in %1% on internet dating site. Find sweet love or sex dating and flirt in %2%, %3% with %site_name%
nl_nl: Gratis online dating in %0% met alleenstaande vrouwen & mannen. Bekenden, ontmoet mensen & vindt vrienden in %1% op internet dating site. Zoek naar liefde of sex dating en flirt in %2%, %3% met %site_name%

source: meeting woman, meeting man, %0%, %1%, meet people, networking, friends, communicate, meet online, online community, clubs, announces meeting, free dating, dating, %2% dating, communication, matrimonial meeting, sharing photos, flirt, finding friends, classifieds, personals, online, social networking
nl_nl: ontmoet vrouwen, ontmoet mannen, %0%, %1%, ontmoet mensen, networking, vrienden, communiceer, ontmoet online, online community, clubs, meld ontmoetingen, gratis daten, dating, %2% dating, communicatie, paren ontmoetingen, foto's delen, flirt, vindt vrienden, advertenties, persoonlijkheden, online, social networking

source: Meet new people in %0% %1%
nl_nl: Ontmoet nieuwe mensen in %0% %1%

source: %n% member
nl_nl: %n% lid

source: %0% lives near %1% %2%
nl_nl: %0% woont bij %1% %2%

source: Error, country is empty.
nl_nl: Fout, land is niet aangegeven.

source: The Hot Friend of %0%. Meet new people and make new friends, sex friends, hot friends for Flirt, Speed Dating or social relationship with %site_name%
nl_nl: De Hot Friend van %0%. Ontmoet nieuwe mensen en maak nieuwe vrienden, sex maatjes, hete vrienden om te flirten, speeddaten of gewoon vriendschap met %site_name%

source: friend,friends,girl friend,boy friend,sex friend,hot friend,new friend,friendship,dating,flirt,%0%
nl_nl: vriend, vriendin,vienden,sex vriend,sex maatje,hete vriend, heet vriendje,heet vriendinnetje,vriendschap,dating,daten,flirt,flirten,%0%

source: No Friend found on the profile of "%0%"
nl_nl: Geen vrienden gevonden op het profiel van "%0%"

source: %0%'s Friends:
nl_nl: %0%'s Vrienden:

source: %n% Friend
nl_nl: %n% Vriend

source: No Mutual Friend found on the profile of "%0%"
nl_nl: Geen Wederzijdse Vriend gevonden op het profiel van "%0%"

source: %0%'s Mutual Friends:
nl_nl: %0%'s Wederzijdse Vrienden:

source: %n% Mutual Friend
nl_nl: %n% Wederzijdse Vriend

source: Search a Friend on the profile of %0%
nl_nl: Zoek een Vriend op het profiel van %0%

source: Reference: %0%
nl_nl: Referentie: %0%

source: Action: %0%
nl_nl: Aktie: %0%

source: Sign Up for Free Online Dating - STEP 2/3
nl_nl: Schrijf je GRATIS in voor Online Dating - STAP 2/3

source: Sign up - Step 2/3
nl_nl: Inschrijven - Stap 2/3

source: Sign Up for Free Online Dating - STEP 3/3
nl_nl: Schrijf je GRATIS in voor Online Dating - STAP 3/3

source: Sign up - Step 3/3
nl_nl: Inschrijven - Stap 3/3

source: You cannot be your own friend.
nl_nl: Je kan je eigen vriend niet zijn.

source: Unable to add to friends list, please try later.
nl_nl: Niet mogelijk om een vrienden lijst toe te voegen, probeer later nog eens.

source: This profile already exists in your friends list.
nl_nl: Dit profiel bestaat al in je lijst met vrienden.

source: Profile ID does not exist.
nl_nl: Profiel ID bestaat niet.

source: This profile has been successfully added to your friends list.
nl_nl: Dit profiel is met succes toegevoedg aan je lijst met vrienden.

source: Cannot approve friend, please try later.
nl_nl: Kan de vriend niet goedkeuren, probeer later nog eens.

source: The friends has been approved.
nl_nl: Deze vriend is goedgekeurd.

source: Cannot remove friend, please try later.
nl_nl: Kan de vriend niet verwijderen, probeer later nog eens.

source: The friends we been deleted.
nl_nl: De vrienden die we hebben verwijderd.

source: Hello %0%!<br /><strong>%1%</strong> sent you a friendship request on %2%.<br /> <a href="%3%">Click here</a> to see your friend request.
nl_nl: Hallo %0%!<br /><strong>%1%</strong> stuurde je een vriendschapsverzoek op %2%.<br /> <a href="%3%">Klik hier</a> om het vriendschapsverzoek te zien..

source: %0% wants to be friends with you on %1%
nl_nl: %0% wil een vriend van je zijn op %1%

source: Posted on: %0%
nl_nl: Gepost op: %0%

source: Last Edited %0%
nl_nl: Laatst Bewerkt %0%

source: Read more
nl_nl: Lees meer

source: Oops, your post could not be sent. Please try again later.
nl_nl: Sorry, je post kan niet worden verzonden. Probeer later opnieuw.

source: Your post was sent successfully!
nl_nl: Je post is met succes verzonden!

source: Oops, your post could not be saved. Please try again later.
nl_nl: Sorry, je post kan niet worden opgeslagen. Probeer later opnieuw.

source: Your post was saved successfully!
nl_nl: Je post is met succes opgeslagen!

source: Your post has been sent successfully!
nl_nl: Je posting is met succes verzonden!

source: Content:
nl_nl: Inhoud:

source: Stay signed in
nl_nl: Blij ingelogd

source: Newsletters
nl_nl: Nieuwsbrief

source: By enabling this option, you would be likely to receive occasional news on our website and our services and offers, promotions and other benefits to our partners.
nl_nl: Door deze optie aan te zetten, vindt je het leuk om zo nu en dan nieuws op en over onze website, diensten en aanbiedingen als ook de extra voordeeltjes van onze partners te ontvangen.

source: Yes
nl_nl: Ja

source: No
nl_nl: Nee

source: Friend requests
nl_nl: Vrienden verzoeken

source: Back to Browse Users
nl_nl: Terug naar Gebruikers Bladeren

source: Membership Group:
nl_nl: Leden Groep:

source: Gender:
nl_nl: Geslacht:

source: Interested in:
nl_nl: Geinterreseerd in:

source: Search a Friend of "%0%"
nl_nl: Zoek iemand van "%0%"

source: Universal Login
nl_nl: Algemene Login

source: your-user-name
nl_nl: je-gebruikers-naam

source: This username will be used for your site url.
nl_nl: Deze gebruikersnaam wordt gebruikt voor je site url hier.

source: Please specify whom you are looking for
nl_nl: Geef eens aan waar je naar zoekt

source: Describe yourself in a few words. Your description should be at least 20 characters long.
nl_nl: Beschrijf jezelf in een paar woorden. Je beschrijving moet minimaal 20 karakters lang zijn.

source: Your Avatar
nl_nl: Je Avatar

source: Profile:
nl_nl: Profiel:

source: Who can view your profile?
nl_nl: Wie can je profiel zien?

source: Everyone (including people who are not %0% members).
nl_nl: Iedereen (inclusief mensen die geen %0% leden zijn).

source: Only %0% members who are logged in.
nl_nl: Slechts %0% leden zijn ingelogd.

source: Only me.
nl_nl: Alleen ik.

source: Web search engine:
nl_nl: Zoek machine:

source: Do you want to be included in search results?
nl_nl: Wil je ook in andere zoekmachines opgenomen worden?
