Repository: pH7Software/pH7-Social-Dating-CMS
Catalog: _protected/app/langs/*/LC_MESSAGES/global.po
Languages: nl_nl

source: Your account has been successfully validated. You can now login!
nl_nl: Je inschrijving is met succes gevalideerd. Je kunt nu inloggen!

source: Invalid approach, please use the link that has been send to your email.
nl_nl: Ongeldige ingang. Gelieve de link te gebruiken die naar je is verstuurd via email.

source: %n% Comment
nl_nl: %n% Commentaar

source: log in
nl_nl: Inloggen

source: Please %0% now to meet new people!
nl_nl: Klik %0% om nieuwe mensen te ontmoeten!

source: Activation link: %0%.
nl_nl: Activatie link: %0%.

source: Caution! Your account is not activated yet. You will receive an email of any decision.
nl_nl: Waarschuwing! Je account is nog niet geactiveerd. Je ontvangt ongetwijfeld een email.

source: Password: %0% (please change it next time you login).
nl_nl: Wachtwoord: %0% (verander dit als je de volgende keer gaat inloggen).

source: Password: ****** (This field is hidden to protect against theft of your account. If you have forgotten your password, please request a new one <a href="%0%">here</a>).
nl_nl: Wachwoord: ****** (Dit veld is verborgen in verband met veiligheid. Ale je het wachtwoord vergeten bent, vraag dan een nieuwe aan en klik <a href="%0%">hier</a>).

source: Hi %0%! We are proud to welcome you as a member of %site_name%!
nl_nl: Hallo %0%! We zijn blij je te verwelkomen als lid van %site_name%!

source: Username: %0%.
nl_nl: Gebruikersnaam: %0%.

source: Hello %0%, Welcome to %site_name%!
nl_nl: Hallo %0%, Welkom op %site_name%!

source: Login now!
nl_nl: Log nu in!

source: Please activate your account by clicking the activation link you received by email. If you can not find the email, please look in your SPAM FOLDER and mark as not spam.
nl_nl: Gelieve je account te activeren door te klikken op de link in je ontvangen email. Als je de desbetreffende email niet kan vinden, kijk dan in je SPAM map en markeer ons als geen spam.

source: Your account must be approved by an administrator. You will receive an email of any decision.
nl_nl: Je account moet worden goedgekeurd door een beheerder. Je zult een email ontvangen van de status.

source: Hello %0%!
nl_nl: Hallo %0%!

source: All %site_name%'s team wish you a very happy birthday!
nl_nl: Het hele %site_name%'s team wenst je een Prettige Verjaardag!

source: Enjoy it well and enjoy yourself!
nl_nl: Geniet er goed van!

source: Happy Birthday %0%!
nl_nl: Van Harte Gefeliciteerd %0%!

source: Please you logged!
nl_nl: Gelieve in te loggen!

source: Please go to the administrative part of the site and log in as administrator.
nl_nl: Ga naar het beheerdersgedeelte van de site en log in als beheerder.

source: Oops! You are already connected.
nl_nl: Ohoh! Je bent al ingelogd.

source: Please register or login to use this service.
nl_nl: Gelieve te registreren if in te loggen om van deze dienst gebruik te maken.

source: Dear, %0%
nl_nl: Beste, %0%

source: Somebody tried to connect more %0% times with the IP address: "%1%".
nl_nl: Iemand probeerde meer als %0% keer in te loggen met het IP adres: "%1%".

source: For safety reasons we have blocked access to this person for a delay of %1% minutes.
nl_nl: Om veiligheidredenen hebben we deze persoon geblokkeerd met een vertraging van %1% minuten.

source: If it is you who have made ​​the connection attempts, we suggest you request a new password <a href="%0%">here</a> in %1% minutes.
nl_nl: Als jij het was die de inlogpogingen, adviseren we je om een nieuw wachtwoord aan te vragen door <a href="%0%">hier</a> te klikken over %1% minuten.

source: If you do not know the person who made ​​the connection attempts, you should be very careful and change your password to a password more complicated.
nl_nl: Als je niet weet wie de persoon was die de inlogpogingen deed, moet je voorzichtig zijn en je wachtwoord wijzigen (liefst bijna niet te raden).

source: We also recommend that you change the password for your mailbox, because it is in this box email we send a potential new password in case you forget.
nl_nl: We adviseren je ook om het wachtwoord van je mailbox te veranderen omdat we naar deze mailbox een mogelijk nieuw wachtwoord sturen, in het geval dat je het vergeet.

source: Have a nice day!
nl_nl: Een hele prettige dag!

source: Security Alert : Login Attempts - %site_name%
nl_nl: Beveiligings Melding : Login Pogingen - %site_name%

source: Latest Blog Posts
nl_nl: Laatste Blog Posts

source: Latest Notes
nl_nl: Laatste Artikelen

source: Latest Forum Topics
nl_nl: Laatste Forum Topics

source: Latest Profile Comments
nl_nl: Laatste Profiel Commentaar

source: Latest Blog Comments
nl_nl: Laatste Blog Commentaar

source: Latest Note Comments
nl_nl: Laatste Artikel Commentaar

source: Latest Picture Comments
nl_nl: Laatste Foto Commentaar

source: Latest Video Comments
nl_nl: Laatste Video Commentaar

source: Latest Game Comments
nl_nl: Laatste game Commentaar

source: No News Software.
nl_nl: Geen Nieuws over Software.

source: Your browser is obsolete. Please use a browser that supports HTML5.
nl_nl: Je browser is verouderd. Gebruik een browser die HTML5 ondersteunt.

source: Play/Pause
nl_nl: Afspelen/Pauze

source: Big
nl_nl: Groot

source: Normal
nl_nl: Normaal

source: Small
nl_nl: Klein

source: Forgot your password?
nl_nl: Wachtwoord vergeten?

source: Score: %0% - Votes: %1%
nl_nl: Score: %0% - Stemmen: %1%

source: Please register for free in order to vote.
nl_nl: Registreer gratis om een stem uit te brengen.

source: Administrator
nl_nl: Beheerder

source: Ghost
nl_nl: Geest

source: Add a comment
nl_nl: Toevoegen commentaar

source: OR
nl_nl: OF

source: RSS Feed List
nl_nl: RSS Feed Lijst

source: RSS Feed %site_name%, Free Onlide Dating Site with Webcam Chat Rooms, Meet Single People with %site_name%
nl_nl: RSS Feed %site_name%, Gratis Onlide Dating Site met Webcam Chat Rooms, Ontmoet Single People with %site_name%

source: Not Found RSS Feed!
nl_nl: Geen RSS Feed Gevonden!

source: Map of Website, Free Onlide Dating Site with Webcam Chat Rooms, Meet Single People with %site_name%
nl_nl: Map van de Website, Gratis Online Dating Site met Webcam Chat Rooms, Ontmoet Alleenstaande Mensen met %site_name%

source: Not Found Site Map!
nl_nl: Geen Site Map Gevonden!

source: picture,photo,pictures,photos,album,albums,picture album,photo album,gallery,picture dating
nl_nl: foto,foto's,afbeeldingen,album,albums,picture,foto album,foto gallerij,gallerij,foto dating

source: Add a new Album
nl_nl: Nieuwe Album toevoegen

source: Add some new Pictures
nl_nl: Voeg wat Foto's toe

source: Edit Album
nl_nl: Album bewerken

source: Edit Picture
nl_nl: Bewerk Foto

source: %0%'s Albums | Picture Albums of the Dating Social Community - %site_name%
nl_nl: %0%'s Albums | Foto Albums van de Dating Social Community - %site_name%

source: Empty Photo Album.
nl_nl: Lege Foto Album.

source: The Album of <a href="%0%">%1%</a>
nl_nl: De Album van <a href="%0%">%1%</a>

source: Photo Gallery Community
nl_nl: Foto Gallerij Community

source: Album of <a href="%0%">%1%</a>
nl_nl: Album van <a href="%0%">%1%</a>

source: Album of %0%
nl_nl: Album van %0%

source: Browse Photos From %0% | Picture Album Social Community - %site_name%
nl_nl: Blader door de Foto's van %0% | Foto Album Social Community - %site_name%

source: Photo of <a href="%0%">%1%</a>
nl_nl: Foto van <a href="%0%">%1%</a>

source: Photo of %0%, %1%
nl_nl: Foto van %0%, %1%

source: Photo of %0%, %1%, %2%
nl_nl: Foto van %0%, %1%, %2%

source: picture,photo,pictures,photos,album,albums,picture album,photo album,gallery,%0%,%1%,%2%
nl_nl: afbeelding,foto,afbeeldingen,foto's,album,albums,afbeeldingen album,photo album,gallerij,%0%,%1%,%2%

source: Your picture has been deleted!
nl_nl: Je foto is verwijderd!

source: Your album has been deleted!
nl_nl: Je album is verwijderd!

source: Search Picture - Looking a picture
nl_nl: Foto Zoeken - Bekijk een foto

source: Sorry, Your search returned no results!
nl_nl: Sorry, Je zoekopdracht heeft geen resultaten!

source: Dating Social Picture - Your search returned
nl_nl: Social Dating Foto - Resultaat zoekopdracht

source: %n% Picture Result!
nl_nl: %n% Foto Resultaat!

source: Search - %site_name% is a Dating Social Photo Community!
nl_nl: Zoeken - %site_name% is een Dating Social Foto Community!

source: search,picture,photo, photo gallery,dating,social network,community,music,movie,news,picture sharing
nl_nl: zoeken,afbeelding,foto,foto gallerij,dating,social network,community,muziek,film,nieuws,foto's delen

source: ID or Name of Picture:
nl_nl: ID of Naam van de FotoL

source: Title
nl_nl: Titel

source: Popular
nl_nl: Populair

source: Rated
nl_nl: Gewaardeerd

source: Created Date
nl_nl: Gemaakt op

source: Updated Date
nl_nl: Bijgewerkt op

source: Name of your photo:
nl_nl: Naam van je foto:

source: Description of your photo:
nl_nl: Beschrijving van je foto:

source: Name of your album:
nl_nl: Naam van je album:

source: Description of your album:
nl_nl: Beschrijving van je album:

source: Thumb of the your album
nl_nl: Miniatuur van je album

source: Choose your album - OR - <a href="%0%">Add a new Album</a>
nl_nl: Kies je album - OF - <a href="%0%">Voeg een nieuw Album toe</a>

source: Name of your photo(s):
nl_nl: Naam van je foto(s):

source: Your picture(s)
nl_nl: Je foto(s)

source: You can select multiple photos at once by clicking multiple files while holding down the "CTRL" key.
nl_nl: Je kan meerdere foto's tegelijk selecteren door te klikken op meerdere foto's tegelijk met de "CTRL" toets ingedrukt.

source: Note:
nl_nl: Noot:

source: Please be patient while downloading pictures, this may take time (especially if you download a lot of photos at once).
nl_nl: Gelieve even geduld te hebben tijdens het downloaden van foto's. Dit kan enige tijd kosten (vooral als je meerdere foto's tegelijkertijd download)

source: Your album has been updated successfully!
nl_nl: Je album is met succes bijgewerkt!

source: Your photo has been updated successfully!
nl_nl: Je foto is met succes bijgewerkt!

source: Please add a category before you add some photos.
nl_nl: Voeg eerst een categorie toe voordat je wat foto's toevoegd.

source: Your photo(s) has been added successfully!
nl_nl: Je foto(s) zijn met succes toegevoegd!

source: Report abuse contents
nl_nl: Rapporteer misbruik inhoud

source: Watching Report
nl_nl: Bekijken Rapportage

source: The report has been deleted.
nl_nl: De rapportage is verwijderd.

source: A problem occurred during the deleted of the reporting.
nl_nl: Er is een probleem opgetreden tijdens het verwijderen van de rapportage.

source: The Report we been deleted.
nl_nl: Rapportage wat we hebben verwijderd.

source: Cannot remove Report, please try later.
nl_nl: Kan de rapportage niet verwijderen, probeer later nog eens

source: Reporter:
nl_nl: Verslaggever:

source: Contant Type:
nl_nl: Vorm van inhoud:

source: Description of report:
nl_nl: Beschrijving van het rapport:

source: Date:
nl_nl: Datum:

source: Spam report from %site_name%
nl_nl: Spam rapport van %site_name%

source: Do your want to report this?
nl_nl: Wil je dit rapporteren?

source: Type the Content
nl_nl: Soort Inhoud

source: Profile
nl_nl: Profiel

source: Message
nl_nl: Bericht

source: Comment
nl_nl: Commentaar

source: Photo
nl_nl: Foto

source: Comment:
nl_nl: Commentaar:

source: Please tell us why you want to report this content (scam, illegal content, adult content, etc.). Help us to eliminate scams, fake profiles, spam ... Thank you
nl_nl: Vertel ons waarom je de inhoud wil rapporteren (scam, illegale inhoud, porno, etc). Help ons om scams, nepprofielen, spam aan te vechten... Bedankt!

source: Report this
nl_nl: Meld dit

source: You have already reported abuse about this profile.
nl_nl: Je hebt al een misbruik melding over dit profiel gedaan.

source: Unable to report abuse.
nl_nl: Niet mogelijk om misbruik te melden.

source: You have successfully reported abuse about this profile.
nl_nl: Je hebt met succes misbruik geraporteerd over dit profiel.

source: Contact Us
nl_nl: Contacteer Ons

source: Contact %site_name%
nl_nl: Contacteer %site_name%

source: No Phone
nl_nl: Geen Telefoon

source: No Site
nl_nl: Geen Website

source: Last Name: %0%
nl_nl: Achternaam: %0%

source: Phone Number: %0%
nl_nl: Telefoon Nummer: %0%

source: Subject: %0%
nl_nl: Onderwerp: %0%

source: Message: %0%
nl_nl: Bericht: %0%

source: URL Page
nl_nl: URL Pagina

source: User come from: %0%
nl_nl: Gebruiker komt uit: %0%

source: Message from contact form %0%
nl_nl: Bericht vanaf het contact formulier %0%

source: Your First Name:
nl_nl: Je Voornaam:

source: Enter your first name.
nl_nl: Geef je voornaam in.

source: Your Last Name:
nl_nl: Je Achternaam:

source: Enter your last name.
nl_nl: Geef je achternaam in.

source: Enter your valid email address.
nl_nl: Geef je geldige email adres in.

source: Enter full phone number with area code.
nl_nl: Geef je volledige telefoonnummer in met kengetal.

source: If you have a website, please enter your site address.
nl_nl: Als je een website hebt, geef dan het adres op.

source: Your Subject:
nl_nl: Je Onderwerp:

source: Enter the subject of the message.
nl_nl: Geef het onderwerp van het bericht in:

source: Your Message:
nl_nl: Je Bericht:

source: Enter your message.
nl_nl: Geef je bericht op.

source: Enter the code above.
nl_nl: Voer de bovenstaande code in.

source: Contact US
nl_nl: Contacteer Ons

source: Your message has been sent successfully!
nl_nl: Je bericht is met succes verzonden!

source: Come take your best pictures of you and your friends on the wall of the best photo shoots!
nl_nl: Kom en maak je mooiste foto's van jou en je vrienden op de muur van de beste foto shoots!

source: Guaranteed fun!
nl_nl: Gegarandeerd Plezier!

source: Come take your best videos of you and your friends on the wall of the best video shoots!
nl_nl: Kom en maak je mooiste foto's van jou en je vrienden op de muur van de beste foto shoots!

source: The photo has been deleted!
nl_nl: De foto is verwijderd!

source: All Fields
nl_nl: Alle Velden

source: Add a Field
nl_nl: Veld Toevoegen

source: Edit a Field
nl_nl: Veld Bewerken

source: Field "%0%" is not found!
nl_nl: Veld "%0%" is niet gevonden!

source: The field has been deleted
nl_nl: Het veld is verwijderd

source: An error occurred while deleting the field.
nl_nl: Er is een fout opgetreden tijdens het verwijderen van het veld.

source: Field Type:
nl_nl: Veld type:

source: Text Box
nl_nl: Tekst Box

source: Number
nl_nl: Getal

source: Field Name:
nl_nl: Veld Naam:

source: Length Field:
nl_nl: Veld Lengte:

source: Default Field Value
nl_nl: Standaard Veld Waarde

source: Edit
nl_nl: Bewerk

source: Add
nl_nl: Toevoegen

source: Bad field name!
nl_nl: Slechte veld naam!

source: The field has been edited.
nl_nl: Het veld is bewerkt.

source: Oops! An error occurred while adding the field, please try again.
nl_nl: Ohoh! Er is een fout opgetreden tijdens het toevoegen van het veld, probeer opnieuw.

source: Oops! The field already exists!
nl_nl: Ohoh! Het veld bestaat al!

source: The field has been added.
nl_nl: Het veld is toegevoegd.

source: The Blog of %site_name%
nl_nl: De Blog van %site_name%

source: Empty Blog
nl_nl: Lege Blog

source: Oops! Empty Blog...
nl_nl: Ohoh! Lege Blog...

source: Search by Category: "%0%" Blog
nl_nl: Zoek middels Categorie: "%0%" Blog

source: %n% Blog Result!
nl_nl: %n% Blog Resultaat!

source: Search Blog Post by Category %0% - Dating Social Community Blog
nl_nl: Doorzoek Blog postingen middels categorie %0% - Dating Social Community Blog

source: search,post,blog,dating,social network,community,news
nl_nl: zoeken,posting,blog,dating,social network,nieuws

source: Search Blog - Looking a post
nl_nl: Blog Zoeken - Zoeken naar een posting

source: Dating Social Blog - Your search returned
nl_nl: Dating Social Blog - Resultaat Zoekopdracht

source: Search - Dating Social Community Blog
nl_nl: Zoeken - Dating Social Community Blog

source: search,blog,dating,social network,community,news
nl_nl: zoeken,blog,dating,social netwerk,community,nieuws

source: Welcome to the Blog administrator mode.
nl_nl: Welkom bij de Blog beheerder modus

source: Add a Post
nl_nl: Posting Toevoegen

source: Edit the Post
nl_nl: Posting Bewerken

source: The thumbnail has been deleted successfully!
nl_nl: De miniatuur is met succes verwijderd!

source: Title of article:
nl_nl: Titel van het artikel:

source: Article ID:
nl_nl: Artikel ID:

source: your-address
nl_nl: je-adres

source: Contents:
nl_nl: Inhoud:

source: Content of the article
nl_nl: Inhoud van het artikel

source: The language of your article:
nl_nl: De taal van je artikel:

source: EX: "en", "fr", "es", "js"
nl_nl: EX: "en", "fr", "es", "js", "nl"

source: Slogan:
nl_nl: Slagzin:

source: Thumbnail:
nl_nl: Miniatuur:

source: Tags:
nl_nl: Trefwoorden:

source: Separate keywords by commas and without spaces between the commas.
nl_nl: Splits trefwoorden met komma's zonder spaties tussen de komma's.

source: Title (meta tag):
nl_nl: Titel (meta tag):

source: Description (meta tag):
nl_nl: Beschrijving (meta tag):

source: Keywords (meta tag):
nl_nl: Trefwoorden (meta tag):

source: Separate keywords by commas.
nl_nl: Gescheiden trefwoorden door komma's.

source: Enable Comment:
nl_nl: Commentaar Aanzetten:

source: Name, Keyword of post, or ID of Blog Post:
nl_nl: Naam, Trefwoord van posting, of ID van de Blog posting:

source: Article ID will be the name of the url.
nl_nl: Artikel ID zal de naam van de URL zijn.

source: EX: "en", "fr", "es", "jp"
nl_nl: Bijvoorbeeld: "en", "fr", "es", "jp", "nl"

source: Thumbnail
nl_nl: Miniatuur

source: The current thumbnail of your post.
nl_nl: De huidige miniatuur van je posting.

source: Remove this thumbnail?
nl_nl: Deze miniatuur verwijderen?

source: Post Not Found!
nl_nl: Post Niet Gevonden!

source: The ID of the article is invalid or incorrect.
nl_nl: De ID van het artikel is ongeldig od niet correct.

source: Your post has been saved successfully!
nl_nl: Je posting is met succes opgeslagen!

source: An error occurred while adding the article.
nl_nl: Er is eebn fout opgetreden tijdens het toevoegen van het artikel.

source: Post created successfully!
nl_nl: Posting met succes gemaakt!

source: Love Calculator with <span class="pH1">You</span> and <span class="pH1">%0%</span>
nl_nl: Liefdes Calculator met <span class="pH1">Jij</span> en <span class="pH1">%0%</span>

source: Bad Request
nl_nl: Slecht Verzoek

source: The request cannot be fulfilled due to bad syntax.
nl_nl: het verzoek kan niet worden ingewilligd door een slechte syntax.

source: Unauthorized
nl_nl: Ongeautoriseerd

source: Your IP address or the username/password you entered were not correct. Your request was denied as you have no permission to access the data.
nl_nl: Je IP adres of je gebruikersnaam/wachtwoord die je in hebt gegeven is onjuist. Je verzoek is afgewezen omdat je geen toegang hebt tot de data.

source: Payment Required
nl_nl: Betaling benodigd

source: The data is not accessible at the time. The owner of the space has not yet payed their service provider.
nl_nl: De data is momenteel niet beschikbaar. De eigenaar van de ruimte heeft nog niet betaald aan de service provider.

source: Forbidden
nl_nl: Verboden

source: Your IP address or the username/password you entered were not correct. Your request was denied as you have no permission to access the data.<br />OR<br />The server was unable to serve the data that was requested.
nl_nl: Je IP adres of je gebruikersnaam/wachtwoord die je in hebt gegeven is onjuist. Je verzoek is afgewezen omdat je geen toegang hebt tot de data.<br />OF<br />De server kon niet de data geven waar je om vroeg.

source: Method Not Allowed
nl_nl: Methode Niet Toegestaan

source: A request was made of a resource using a request method not supported by that resource;[2] for example, using GET on a form which requires data to be presented via POST, or using PUT on a read-only resource.
nl_nl: Een verzoek die is gedaan dooe een bron methode die niet is ondersteund;[2] als voorbeeld, dmv GET op een formulier welke data vereist die aanwezig is via POST, of door gebruik making van PUT op een alleen-lezen bron.

source: Internal Server Error
nl_nl: Interne Server Error

source: The server encountered an error. This is most often caused by a scripting problem, a failed database access attempt, or other similar reasons.<br />Please come back later!
nl_nl: De server stelde een fout vast. Meestal door een script probleem, een fout met database-toegang of andere soortgelijke problemen.<br />Probeer later nog eens!

source: Not Implemented
nl_nl: Niet Geïmplementeerd

source: The method you are using to access the document can not be performed by the server.<br />Possible methods include:
nl_nl: De methode die je gebruikt om toegang tot het document kan niet worden uitgevoerd door de server <br /> Mogelijke methoden zijn:

source: Bad Gateway
nl_nl: Slechte Gateway

source: The server was acting as a gateway or proxy and received an invalid response from the upstream server.
nl_nl: De server werd als gateway of proxy gebruikt en ontving een ongeldig antwoord van de upstream-server.

source: Most likely the client has lost connectivity (disconnected from the internet) or the client's host is having technical difficulties.<br /> This could also meanthat a server that allows access to the requested server is down, having bandwidth/load issues, or otherwise unavailable.
nl_nl: Waarschijnlijk is de verbinding verbroken (onderbreking van het internet) of de provider heeft technische problemen. <br /> Dit kan ook een server zijn die het mogelijk maakt dat de toegang tot de opgevraagde server down is. Dit kan een bandbreedte/belasting kwestie of op een andere wijze niet beschikbaar.

source: HTTP Version Not Supported
nl_nl: HTTP Versie Niet Ondersteund

source: The server does not support the HTTP protocol version used in the request.
nl_nl: De server ondersteund niet de HTTP protocol versie die in het verzoek is gebruikt.

source: Online Dating Sie for Single!
nl_nl: Online Dating Site voor Alleenstaande!

source: Meet new people and have meetings near you with %site_name%, the new online dating free site new generation with webcam chat!
nl_nl: Ontmoet nieuwe mensen en ontmoet ze bij je in de buurt met %site_name%, de nieuwe gratis online dating site van de nieuwe generatie met webcam chat!

source: dating, free dating, online dating, people, meeting, romance, woman, man, dating site, flirt, chat, chat room, webcam, video chat, %site_name%
nl_nl: dating, gratis dating, online dating, mensen, ontmoeten, romantisch, vrouwen, mannen, dating site, flirt, chat, chat room, webcam, video, chat, %site_name%

source: Free Online Dating with %site_name%!
nl_nl: Gratis Online Dating met %site_name%!

source: Welcome to we Web Dating Site!
nl_nl: Welkom op de Gratis Web Dating Site

source: About this web site %site_name%
nl_nl: Over deze website %site_name%

source: Help about of %site_name%
nl_nl: Hulp van %site_name%

source: Frequently asked questions of %site_name%
nl_nl: Meest gestelde vragen over %site_name%

source: Terms and Conditions of Use
nl_nl: Algemene Voorwaarden voor Gebruik

source: Terms and Conditions of Use, Terms of Use - %site_name%
nl_nl: Algemene Voorwaarden voor Gebruik - %site_name%

source: Affiliate Terms and Conditions of Use
nl_nl: Algemene Voorwaarden voor Gebruik Affiliates

source: Affiliate Terms and Conditions of Use, Terms of Use - %site_name%
nl_nl: Algemene Voorwaarden voor Gebruik Affiliates - %site_name%

source: Privacy Policy
nl_nl: Privacybeleid

source: Privacy Policy - %site_name%
nl_nl: Privacybeleid - %site_name%

source: Imprint
nl_nl: Afdruk

source: Imprint - %site_name%
nl_nl: Afdruk - %site_name%

source: Help Us
nl_nl: Help Ons
