Repository: pH7Software/pH7-Social-Dating-CMS
Catalog: _protected/app/langs/*/LC_MESSAGES/global.po
Languages: nl_nl

source: Yes, include my profile in search results (%site_name%'s search, Google, Bing, Yahoo, etc.).
nl_nl: Ja, inclusief mijn profiel in zoekresultaten (%site_name%'s search, Google, Bing, Yahoo, etc.).

source: No, do not include my profile in search results.
nl_nl: Nee, doe dit niet met mijn profiel in zoek resultaten.

source: Show profile visitors:
nl_nl: Bekijk je profile bezoekers:

source: Yes, display members who viewed my profile (Selecting this option will allow other members to see that you visited their profile).
nl_nl: Ja, laat de leden zien die naar mijn profiel hebben gekeken. (Deze optie gebruiken betekend ook dat andere jou ook kunnen zien)

source: No, don't display members who viewed my profile. (Selecting this option will prevent you from seeing who visited your profile).
nl_nl: Nee, laat de leden niet zien die naar mijn profiel hebben gekeken. (Deze optie gebruiken betekend dat een ander jou ook nooit kan als je hun profiel bekeken hebt)

source: Presence:
nl_nl: Aanwezigheid:

source: Your status
nl_nl: Je status

source: Your Wallpaper for your Profile:
nl_nl: Je Achtergrond voor je Profiel:

source: Find Search a Visitor of "%0%"
nl_nl: Vindt een Bezoeker van "%0%"

source: Last Seen on your profile
nl_nl: Laatst gezien op je profiel

source: Your Email
nl_nl: Je email

source: Your Password
nl_nl: Je Wachtwoord

source: Your message has been added successfully!
nl_nl: Je bericht is met succes toegevoegd!

source: Your Wallpaper has been updated successfully!
nl_nl: Je Achtergrond is met succes bijgewerkt!

source: Your privacy settings have been saved successfully!
nl_nl: Je privacy instellingen zijn met succes opgeslagen!

source: Your avatar has been updated successfully!
nl_nl: Je avatar is met succes bijgewerkt!

source: Your notifications settings have been saved successfully!
nl_nl: Je notificatie instellingen zijn met succes opgeslagen!

source: No reference
nl_nl: Geen referenties

source: forum,discussion,dating forum,social forum,people,meet people,forums,free dating forum,free forum,community forum,social forum
nl_nl: forum,discussie,dating forum,social forum,mensen,ontmoet mensen,forums,gratis dating forum,gratis forum,community forum,social forum

source: No Forums found.
nl_nl: Geen Forums gevonden.

source: Discussions Forums - %site_name%
nl_nl: Discussie Forums - %site_name%

source: Discussions Forums, Social Network Site - %site_name%
nl_nl: Discussie Forums, Social Network Site - %site_name%

source: Discussions Forums, Social Network Site
nl_nl: Discussie Forums, Social Network Site

source: No Topics found.
nl_nl: Geen Topics gevonden.

source: %0% - Topics - Discussions Forums
nl_nl: %0% - Topics - Discussie Forums

source: %0%,forum,discussion,dating forum,social forum,people,meet people,forums,free dating forum
nl_nl: %0%,forum,discussie,dating forum,social forum,mensen,ontmoet people,forums,gratis dating forum

source: Topic Not Found!
nl_nl: Topic Niet Gevonden!

source: Latest Forum Posts
nl_nl: Laatste Forum Post

source: %0% Topics - Discussions Forums
nl_nl: %0% Topics - Discussie Forums

source: %0%,%1%,forum,discussion,dating forum,social forum
nl_nl: %0%,%1%,forum,discussie,dating forum,social forum

source: No found the forum post of %0%.
nl_nl: Posting van %0% niet gevonden op forum.

source: %0%'s Forum Posts
nl_nl: %0%'s Forum Postings

source: Search Forum - Looking a Forum Post | %site_name%
nl_nl: Doorzoek Forum - Zoeken naar een Forum Posting | %site_name%

source: Search Topic - Discussion Forum - %site_name%
nl_nl: Zoek Topic - Discussie Forum - %site_name%

source: Forums - Your search returned
nl_nl: Zoeken - Je zoekopdracht vindt

source: %0% Forum Result!
nl_nl: %0% Forum Resultaat!

source: Search - Discussion Forum
nl_nl: Zoeken - Discussie Forum

source: search,forum,forums,discussion forum
nl_nl: zoek,doorzoek,forum,forums,discussie forum

source: Add a new Topic
nl_nl: Voeg een nieuw Topic toe

source: Edit Topic
nl_nl: Bewerk Topic

source: Edit your Message
nl_nl: Bewerk je Bericht

source: Reply Message
nl_nl: Antwoord Bericht

source: Your topic has been deleted!
nl_nl: Je topic is verwijderd!

source: Oops! Your topic could not be deleted
nl_nl: Ohoh! Je topic kon niet worden verwijderd

source: Your message has been deleted!
nl_nl: Je bericht is verwijderd!

source: Oops! Your message could not be deleted
nl_nl: Ohoh! Je bericht kon niet worden verwijderd

source: Welcome to the forum administrator mode.
nl_nl: Welkom bij de Forum Administrator modus.

source: Add a new Category
nl_nl: Voeg een nieuwe Categorie toe

source: Add a new Forum
nl_nl: Voeg een nieuw Forum toe

source: Edit the Category
nl_nl: Bewerk de Categorie

source: Edit the Forum
nl_nl: Bewerk het Forum

source: Your Category has been deleted!
nl_nl: Je Categorie is verwijderd!

source: Oops! Your Category could not be deleted
nl_nl: Ohoh! Je Categorie kon niet worden verwijderd

source: Your Forum has been deleted!
nl_nl: Je Forum is verwijderd!

source: Oops! Your Forum could not be deleted
nl_nl: Ohoh! Je Forum kon niet worden verwijderd

source: Category Name:
nl_nl: Categorie Naam:

source: Forum Name:
nl_nl: Forum Naam:

source: Subject:
nl_nl: Onderwerp:

source: Name, Keyword of message, Author (username) or ID of Topic Forum:
nl_nl: Naam, Trefwoord van bericht, Auteur (gebruikersnaam) of ID van Topic Forum:

source: The Category has been updated successfully!
nl_nl: De Catergorie is met succes bijgewerkt!

source: Your message has been updated successfully!
nl_nl: Je bericht is met succes bijgewerkt!

source: Payment Zone
nl_nl: Betaal Gedeelte

source: No membership found!
nl_nl: Geen lidmaatschap gevonden!

source: Memberships List
nl_nl: Lidmaatschap Lijst

source: Pay!
nl_nl: Betaal!

source: Provinder Not Found!
nl_nl: Provider Niet Gevonden!

source: Thank you!
nl_nl: Bedankt!

source: Error occurred!
nl_nl: Fout opgetreden!

source: Administration of Payment System
nl_nl: Administratie van het Betaal Systeem

source: Config Payment Gateway
nl_nl: Configuratie Betaal Systeem

source: Add Membership
nl_nl: Toevoegen Lidmaatschap

source: Update Membership
nl_nl: Bijwerken Lidmaatschap

source: The Membership has been removed!
nl_nl: Dit Lidmaatschap is verwijderd!

source: The payment was aborted, no changes have been made to your account.
nl_nl: De betaling is afgebroken en er zijn geen veranderingen gemaakt op je account.

source: Buy %0% with %1%!
nl_nl: Koop %0% met %1%!

source: Name:
nl_nl: Naam:

source: Price:
nl_nl: Prijs:

source: Currency: %0%. 0 = Free. To change the currency, please <a href="%1%">go to settings</a>.
nl_nl: Munteenheid: %0%. 0 = Free. Om de munteenheid te veranderen <a href="%1%">ga naar instellingen</a>.

source: Expiration Days:
nl_nl: Verval Dagen:

source: 0 = Unlimited
nl_nl: 0 = Onbegrenst

source: Active:
nl_nl: Actief:

source: Enabled
nl_nl: Aan

source: Disabled
nl_nl: Uit

source: Update
nl_nl: Bijwerken

source: The Membership has been saved successfully!
nl_nl: Het Lidmaatschap is met succes opgeslagen!

source: The Membership has been added!
nl_nl: Het lidmaatschap is toegevoegd!

source: MailBox : Compose a new message
nl_nl: MailBox: Stel een nieuw bericht samen

source: Compose a new message
nl_nl: Stel een nieuw bericht samen

source: Sorry %0%, you do not have any messages.
nl_nl: Sorry %0%, je hebt geen berichten.

source: Empty!
nl_nl: Leeg!

source: MailBox : Trash
nl_nl: Mailbox : Prullenbak

source: Mail | Message - Your search returned
nl_nl: Mail | Berichten - Je zoekopdracht geeft

source: %n% Mail Result!
nl_nl: %n% Mail Resultaat!

source: Your message(s) has been deleted successfully!
nl_nl: Je bericht(en) is/zijn met succes verwijderd!

source: No messages found!
nl_nl: Geen berichten gevonden!

source: Email List
nl_nl: Email lijst

source: Your message has been successfully removed!
nl_nl: Je bericht is met succes verwijderd!

source: Search a message:
nl_nl: Zoek een bericht:

source: Enter a keyword in the Subject, Contents, Author (username, first name, last name) or message ID.
nl_nl: Geef een trefwoord voor het Onderwerp, Inhoud, Auteur (gebruikersnaam, voornaam, achternaam) of bericht ID.

source: Subject
nl_nl: Onderwerp

source: Author (username)
nl_nl: Auteur (gebruikersnaam)

source: Where:
nl_nl: Waar:

source: Trash
nl_nl: Vuilnisbak

source: Recipient:
nl_nl: Ontvanger:

source: Your message:
nl_nl: Je bericht:

source: Oops! You can not send a message to yourself.
nl_nl: Ohoh! Je kan geen berichten naar jezelf sturen.

source: Oops! You cannot reply to administrator! If you want to contact us, please use our <a href="%0%">contact form</a>.
nl_nl: Ohoh! Je kan niet reageren als beheerder! Als je contact met ons wilt opnemen ga dan naar het <a href="%0%">contact formulier</a>.

source: Oops! The username "%0%" does not exist.
nl_nl: Ohoh! De gebruikersnaam "%0%" bestaat niet.

source: Problem while sending the message. Please try again later.
nl_nl: Er is een probleem met het zenden van het bericht. Probeer later nog eens.

source: New private message from %0% on %site_name%
nl_nl: Nieuw privé bericht van %0% op %site_name%

source: The Notes of %site_name%
nl_nl: De Artikelen van %site_name%

source: Empty Note
nl_nl: Lege Artikel

source: Oops! Empty Note...
nl_nl: Ohoh! Lege Note...

source: Search by Category: "%0%" Note
nl_nl: Zoeken middels Categorie: "%0%" Artikelen

source: %n% Note Result!
nl_nl: %n% Artikel Resultaat!

source: Search Note Post by Category %0% - Dating Social Community Note
nl_nl: Zoek Artikel Posting middels Categorie %0% - Dating Social Community Artikelen

source: search,post,blog,note,dating,social network,community,news
nl_nl: zoeken,posting,blog,artikel,dating,social network,community,nieuws

source: Search by Author: "%0%" Note
nl_nl: Zoeken met Auteur: "%0%" Artikel

source: Search Note Post by Author %0% - Dating Social Community Note
nl_nl: Zoeken naar Artikel Posting door Auteur %0% - Dating Social Community Artikelen

source: author,search,post,blog,note,dating,social network,community,news
nl_nl: auteur,zoeken,posting,blog,artikel,dating,social network,community,nieuws

source: Search Note - Looking a post
nl_nl: Zoek Artikel - Bekijk een posting

source: Dating Social Note - Your search returned
nl_nl: Dating Social Artikelen - Resultaat zoekopdracht

source: Search - Dating Social Community Note
nl_nl: Zoeken - Dating Social Community Artikelen

source: search,note,dating,social network,community,news
nl_nl: zoeken,artikel,dating,social network,community,nieuws

source: Add a Note
nl_nl: Artikel Toevoegen

source: Edit the Note
nl_nl: Artikel Bewerken

source: Welcome to the Note administrator mode.
nl_nl: Welkom bij de Artikel beheer mode.

source: Unmoderated Notes
nl_nl: Niet Gemodereerde Artikelen

source: Not Note Posts for the treatment of moderate.
nl_nl: Geen Artikel Postingen om door de moderater te behandelen.

source: The Note has been approved!
nl_nl: het Artikel is goedgekeurd!

source: Oops! The Note could not be approved!
nl_nl: Ohoh! Het Artikel kon niet worden goedgekeurd!

source: The language of your post:
nl_nl: De taal van je posting:

source: Search Note Post:
nl_nl: Zoek Artikel Posting:

source: Enter Name, Keyword of post, Author (username, first name, last name) or ID of a Note.
nl_nl: Geef de Naam, Trefwoord van de Posting, Auteur (gebruikersnaam, voornaam, achternaam) of ID van het Artikel.

source: ID Article must be unique!
nl_nl: ID Artikel moet uniek zijn!

source: You can not select more than 3 categories.
nl_nl: je kan niet meer dan 3 categoriën selecteren.

source: Welcome to Universal Login
nl_nl: Welkom bij de Algemene Inlog Pagina

source: Universal Login, Use the service Facebook, Twitter, Yahoo, AOL, Windows Live, Microsoft Live, Google, or other account to login on the social dating site %site_name%
nl_nl: Algemene Login, Gebruik Facebook, Twitter, Yahoo, AOL, Windows Live, Microsoft Live, Google, of een ander account om in te loggen op de social dating site %site_name%

source: connect, login, Register, universal login, Facebook, Twitter, Yahoo, AOL, Windows Live, Microsoft Live, Google, social network, dating site, email
nl_nl: connect, login, Registreer, algemene login, Facebook, Twitter, Yahoo, AOL, Windows Live, Microsoft Live, Google, social network, dating site, email

source: You are successfully registered!
nl_nl: Je bent met succes geregistreerd!

source: Loading...
nl_nl: Laden...

source: Signing in...
nl_nl: Inloggen...

source: The %0% API is incorrect.
nl_nl: De %0% API is onjuist.

source: Config Universal Login
nl_nl: Inloggen Algemene Configuratie

source: Oops! An error has occurred. Please try again later.
nl_nl: Ohoh! Er is een fout opgetreden. Probeer het aub later nog eens.

source: Hi %0%, welcome to %site_name%
nl_nl: Hallo %0%, welkom op %site_name%

source: Hot On Not - Free Online Dating Site
nl_nl: Hot or Not - Free Online Dating Site

source: hot, hot or not, hotornot, sexy, rate, rating, voting, women, free, dating, speed dating, flirt
nl_nl: hot, hot or not, hotornot,heet, sexy, rate, rating,stemmen, voting, women,vrouwen, mannen, single, married, getrouwd, bi, gay, homo, free, dating, speed dating, flirt

source: video,videos,free,free videos,music,online,watch,dating,video dating,social,community,social network,people video,flirt
nl_nl: video,video's,gratis,gratis video's,muziek,online,bekijk,dating,video dating,social,community,social network,people video,flirt

source: Add a new Video
nl_nl: Nieuwe Video toevoegen

source: Edit Video
nl_nl: Video bewerken

source: Empty Video Album.
nl_nl: Lege Video Album

source: Video Gallery Community
nl_nl: Video Gallerij Community

source: %0%'s Albums | Video Albums of the Dating Social Community - %site_name%
nl_nl: %0%'s Albums | Video Albums van de Dating Social Community - %site_name%

source: Browse Videos From %0% | Video Album Social Community - %site_name%
nl_nl: Blader door de Videos van %0% | Video Album Social Community - %site_name%

source: Watch Video of <a href="%0%">%1%</a>
nl_nl: Bekijk de Video van <a href="%0%">%1%</a>

source: Video of %0%, %1%
nl_nl: Video van %0%, %1%

source: Video of %0%, %1%, %2%
nl_nl: Video van %0%, %1%, %2%

source: video,movie,videos,video sharing,music,gallery,%0%,%1%,%2%
nl_nl: video,film,video's,video delen,muziek,gallerij,%0%,%1%,%2%

source: Your video has been deleted!
nl_nl: Je video is verwijderd!

source: Search Video - Looking a video
nl_nl: Video Zoeken - Bekijk een video

source: Dating Social Video - Your search returned
nl_nl: Dating Social Video - Je zoekopdracht vindt

source: %n% Video Result!
nl_nl: %n% Video Resultaat!

source: Search - %site_name% is a Dating Social Video Community!
nl_nl: Zoeken - %site_name% is een Dating Social Video Community!

source: search,video,dating,social network,community,music,movie,news,video sharing
nl_nl: search,video,dating,daten,social network,netwerk,community,music,muziek,movie,film,news,nieuws,video sharing, video delen

source: ID or Name of Video:
nl_nl: ID of Naam van Video:

source: Name of your video(s):
nl_nl: Naam van je video(s):

source: Choose...
nl_nl: Kies...

source: Regular
nl_nl: Standaard

source: Please be patient while downloading video, this may take time (especially if you download a long video).
nl_nl: Even geduld tijdens het downloaden van de video. Dit kost even tijd (vooral als het een lange video is)

source: I have the right to distribute this Video
nl_nl: Ik heb het recht om de Video te verspreiden

source: Embed Code:
nl_nl: Embedded Code:

source: Example: %0%
nl_nl: Voorbeeld: %0%

source: Video from Youtube, Vimeo, DailyMotion or MetaCafe.
nl_nl: Video van Youtube, Vimeo, DailyMotion of MetaCafe.

source: Description of your video:
nl_nl: Beschrijving van je video:

source: Name of your video:
nl_nl: Naam van je video:

source: Your video has been updated successfully!
nl_nl: Je video is met succes bijgewerkt!

source: Please add a category before you add a video.
nl_nl: Voeg een categorie toe voordat je een video toe gaat voegen.

source: Oops, the link of the video looks bad? Check that the link is correct.
nl_nl: Ohoh!, de link van de video ziet er niet goed uit! Controleer de link of die juist is.

source: Unable to retrieve information from the video. Are you sure that the URL of the video is correct?
nl_nl: Het is niet mogelijk om de informatie te krijgen van de video. Weet je zeker dat de URL van de video juist is?

source: Untitled
nl_nl: Geen Titel

source: Invalid Api Video Type! Choose from Youtube, Vimeo, Dailymotion and Metacafe.
nl_nl: Ongeldige Api Video Type! Kies van Youtube, Vimeo, Dailymotion of Metacafe.

source: File exceeds maximum allowed video filesize of %0%!
nl_nl: Bestand is groter dan de maximale video bestandsgrootte van %0%!

source: You must choose a type of video!
nl_nl: Je moet het type van de video selecteren!

source: Your video has been added successfully!
nl_nl: Je video is met succes toegevoegd!

source: comment,comments,social,community,friend,social network,people,dating,post,wall,social dating
nl_nl: commentaar,commentaren,social,community,vriend,social network,dating,posting,muur,social dating

source: Read comment of %0%, %1%. %2%
nl_nl: Lees het commentaar van %0%, %1%. %2%

source: comment,%0%
nl_nl: commentaar,%0%

source: No comments yet, please return to the <a href="%0%">previous page</a>.
nl_nl: Geen commentaar gevonden, ga terug naar de <a href="%0%">vorige pagina</a>.

source: Add a new comment
nl_nl: Nieuw commentaar toevoegen

source: Edit the comment
nl_nl: Bewerk het commentaar

source: The comment has been deleted!
nl_nl: Het commentaar is verwijderd!

source: Whoops! The comment could not be removed!
nl_nl: Ohoh! het commentaar kon niet worden verwijderd!

source: Comment Not Found
nl_nl: Commentaar Niet gevonden

source: No comments yet, <a class="bold" href="%0%">add one</a>!
nl_nl: Momenteel geen commentaar, <a class="bold" href="%0%">voeg er één toe</a>!

source: Your comment has been successfully removed!
nl_nl: Je commentaar is met succes verwijderd!

source: Your comment:
nl_nl: Je commentaar:

source: Edit your comment:
nl_nl: Bewerk je commentaarL

source: The comment recipient does not exists.
nl_nl: De ontvanger voor het commentaar bestaat niet.

source: Oops! Error when adding comment.
nl_nl: Ohoh! Fout opgetreden bij toevoegen commentaar.

source: The comment has been sent successfully!
nl_nl: Het commentaar is met succes verzonden!

source: The comment has been updated successfully!
nl_nl: Het commentaar is met succes bijgewerkt!

source: Oops! Error when updated comment.
nl_nl: Ohoh! Fout tijdens het bijwerken van het commentaar.

source: Free Chat Room Dating
nl_nl: Gratis Chat Room Dating

source: Find Your Match at The Best Free Online Dating Site with Free Chat Rooms, Single Chat Meet People
nl_nl: Vindt je Match op De Beste Gratis Online Dating Site met Gratis Chat Rooms, Alleenstaande Chat om Mensen te Ontmoeten

source: chat, speed dating, meet singles, dating, free dating, chat room, chat webcam
nl_nl: chat, speed dating, ontmoet singles, dating, gratis dating, chat room, chat webcam

source: Welcome to <span class="pH3">Free Chat Room</span> on <span class="pH0">%site_name%</span>!
nl_nl: Welkom op <span class="pH3">Gratis Chat Room</span> op <span class="pH0">%site_name%</span>!

source: Newsletters - Subscribe to our newsletter %site_name% | Social networking, dating website.
nl_nl: Nieuwsbrieven - Schrijf je in voor de nieuwsbrief van %site_name% | Social networking, dating website.

source: newsletter, newsletters, subscription, email, social, social network, social networking, community, metting, dating, friends, people
nl_nl: nieuwsbrief, nieuwsbrieven, inschrijving, email,social network, social networking, community, ontmoeten, dating, vrienden, mensen

source: Newsletter
nl_nl: Nieuwsbrief

source: Search Subscribers
nl_nl: Zoek Abonnees

source: Browse Subscribers
nl_nl: Blader door Abonnees

source: %n% Subscriber
nl_nl: %n% Abonnee

source: The subscribers(s) has been deleted.
nl_nl: De abonnee(s) zijn verwijderd.

source: Search an Subscriber:
nl_nl: Zoek een Abonnee:

source: Enter their ID, Name, Email or IP address.
nl_nl: Geef hun ID, Naam, Email of IP adres.

source: Name
nl_nl: naam

source: ATTENTION! Sending emails may take several tens of minutes/hours.
nl_nl: ATTENTIE! Versturen van emails kan enkele minuten duren en soms uren.

source: Once the form is sent, do not close the browser page!
nl_nl: Als het formulier is verzonden sluit de browser dan niet!

source: Body:
nl_nl: Inhoud:

source: Send!
nl_nl: Verstuur!

source: Your full name:
nl_nl: Je volledige naam:

source: Your email:
nl_nl: Je email:

source: Subscribe
nl_nl: Inschrijven

source: Unsubscribe
nl_nl: Uitschrijven

source: Please activate your subscription by clicking the activation link you received by email. If you can not find the email, please look in your SPAM FOLDER and mark as not spam.
nl_nl: Activeer je inschrijving door op de activatielink te klikken die je in de mail hebt ontvangen. Zie je de mail niet direct, kijk dan eens in je SPAM folder of hij daar niet terecht is gekomen.

source: Oops! You are already subscribed to our newsletter.
nl_nl: Ohoh! Je bent al ingeschreven voor onze nieuwsbrief.

source: Your subscription was successfully canceled.
nl_nl: Je inschrijving is met succes afgebroken.

source: We have not found any subscriber with the email address.
nl_nl: We hebben geen inschrijving kunnen vinden met dit email adres.

source: Hi %0%!
nl_nl: Hallo %0%!

source: Confirm you email address!
nl_nl: Bevestig je email adres!

source: %n% newsletters were sent successfully!
nl_nl: %n% nieuwsbrief is met succes verzonden!

source: game,free,flash,game site,flash game,games,gaming,online game
nl_nl: game,gratis,flash,game site, flash game,games,gaming, online game

source: No Games Found!
nl_nl: Geen Games Gevonden!

source: Games Zone - Free Games
nl_nl: Games Zone - Gratis Games

source: Free Games for Gamers, Flash Games, Free Online Games
nl_nl: Gratis Games voor Gamers, Flash Games, Gratis Online Games

source: Search by Category: "%0%" Game
nl_nl: Categorie doorzoeken: "%0%" Game

source: %n% Game Result!
nl_nl: %n% Game Resultaat!

source: Search the Flash Game in the Category %0% - Community Dating Social Games
nl_nl: Zoek de Flash Game in de Categorie %0% - Community Dating Social Games

source: Search Game - Looking a new Game
nl_nl: Game Zoeken - Zoeken naar een nieuwe Game

source: Game - Your search returned
nl_nl: Spel - Je zoekopdracht vindt

source: Search - Free Games for Gamers, Flash Games, Free Online Games
nl_nl: Zoeken - Gratis Games for Gamers, Flash Games, Gratis Online Games

source: search,game,free,flash,game site,flash game,games,gaming,online game
nl_nl: zoeken,zoek,game,gratis,flash,game site,flash game,games,gaming,online game

source: Wrong download ID specified!
nl_nl: Verkeerde download ID gespecificeerd!

source: Welcome to the Game administrator mode.
nl_nl: Welkom bij de Game beheerder modus.

source: Add a new Game
nl_nl: Nieuwe Game toevoegen

source: Edit Game
nl_nl: Game bewerken

source: The game has been removed.
nl_nl: De game is verwijderd.

source: The game could not be removed.
nl_nl: De game kon niet worden verwijderd.

source: Name of the Game:
nl_nl: Naam van het Spel:

source: Title of the Game:
nl_nl: Titel van de Game:

source: Keywords:
nl_nl: Trefwoorden:

source: Game Not Found!
nl_nl: Game niet gevonden!

source: Search Games
nl_nl: Zoek Games

source: Downloaded
nl_nl: Gedownload

source: Thumbnail of the Game:
nl_nl: Miniatuur van de Game:

source: File of the Game:
nl_nl: Bestand van de Game:

source: The game has been updated successfully!
nl_nl: De update van de game is gelukt!

source: Admin Panel
nl_nl: Administratie Paneel
