Repository: pH7Software/pH7-Social-Dating-CMS
Catalog: _protected/app/langs/*/LC_MESSAGES/global.po
Languages: nl_nl

source: Add an Album
nl_nl: Toevoegen Album

source: My Albums
nl_nl: Mijn Albums

source: Videos Gallery
nl_nl: video's Gallerij

source: My Notes
nl_nl: Mijn Artikelen

source: Friends Management
nl_nl: Vrienden Beheer

source: Friends List
nl_nl: Vrienden Lijst

source: Find a friend in my list
nl_nl: Vindt een vriend in mijn lijst

source: Find a Friend
nl_nl: Vindt een vriend

source: Who Visited My Profile
nl_nl: Wie heeft mijn profiel bezocht

source: Who See Me
nl_nl: Wie heeft me gezien

source: Find someone who has visited my profile
nl_nl: Vindt iemand die mijn profiel heeft bezocht

source: Find some Visitor(s)
nl_nl: Vindt één of meerdere Bezoekers.

source: Logout
nl_nl: Uitloggen

source: Gets Banners
nl_nl: Verkrijg Banners

source: Users/Admins
nl_nl: Gebruikers/Beheerders

source: Users
nl_nl: Gebruikers

source: Browse
nl_nl: Bladeren

source: Search a Users
nl_nl: Zoek een Gebruiker

source: Add User
nl_nl: Gebruiker Toevoegen

source: User Fields
nl_nl: Gebruikers Velden

source: Fields List
nl_nl: Velden Lijst

source: Admins
nl_nl: Beheerders

source: Search an Admin
nl_nl: Zoek een Beheerder

source: Add Admin
nl_nl: Beheerder Toevoegen

source: General
nl_nl: Algemeen

source: Custom Style
nl_nl: Aangepaste Stijl

source: Style
nl_nl: Stijl

source: JavaScript Injection
nl_nl: Javascript Injectie

source: Modules Manager
nl_nl: Module Beheer

source: Mass Mailer
nl_nl: Massa Mailer

source: Subscribers
nl_nl: Abonnees

source: Forum Admin
nl_nl: Forum Beheer

source: Blog Admin
nl_nl: Blog beheer

source: Add a Game
nl_nl: Game Toevoegen

source: Affiliate Admin Manager
nl_nl: Affiliate Beheer

source: Banners Manager
nl_nl: Banners Beheer

source: Affiliates List
nl_nl: Affiliates Lijst

source: Search an Affiliate
nl_nl: Zoek een Affiliate

source: Add Affiliate
nl_nl: Affiliate Toevoegen

source: Affiliate Fields
nl_nl: Affiliate Velden

source: Payment System
nl_nl: Betaal Systeem

source: Payment
nl_nl: Betaling

source: Membership Management
nl_nl: Leden beheer

source: Payment Gateway Config
nl_nl: Betaling Gateway Configuratie

source: Gateway Config
nl_nl: Gateway Configuratie

source: Email Management
nl_nl: Email beheer

source: Messages Monitor
nl_nl: Berichten Monitor

source: Search Email
nl_nl: Zoek Email

source: Search Message
nl_nl: Zoek Bericht

source: Universal Login Config
nl_nl: Standaard Login Configuratie

source: User Moderation
nl_nl: Gebruiker Moderatie

source: Moderation
nl_nl: Moderatie

source: Moderate Albums
nl_nl: Modereer Albums

source: Picture Album
nl_nl: Foto Albums

source: Moderate Pictures
nl_nl: Modereer Foto's

source: Moderate Videos
nl_nl: Modereer Videos

source: Moderate Avatars
nl_nl: Modereer Avatars

source: Moderate Profile Background
nl_nl: Modereer Achtergrond Profiel

source: Profile Background
nl_nl: Profiel Achtergrond

source: Moderate Note
nl_nl: Modereer Artikel

source: Moderate the Note Posts
nl_nl: Modereer de Plaatsingen van Artikelen

source: Note Posts
nl_nl: Artikelen Plaatsingen

source: Moderate the Pictures Webcam
nl_nl: Modereer de Webcam Foto's

source: Pictures Webcam
nl_nl: Foto's Webcam

source: Public File Management
nl_nl: Publiek Bestand Beheer

source: Protected File Management
nl_nl: Beveiligde Bestand Beheer

source: Display Page of Module
nl_nl: Weergave Pagina van Module

source: Page Module
nl_nl: Module Pagina

source: Display Email Template
nl_nl: Weergave Template Email

source: Display the all Templates Files
nl_nl: Weergave alle Template bestanden

source: Templates Files
nl_nl: Template bestanden

source: Suggestion List
nl_nl: Lijst met Suggesties

source: Ban Options
nl_nl: Ban Opties

source: Tools
nl_nl: Gereedschap

source: Caches Controls
nl_nl: Cach Controle

source: Free Space Server
nl_nl: Vrij Ruimte Server

source: Site Statistics
nl_nl: Site Statistieken

source: by
nl_nl: door

source: Edit Account
nl_nl: Bewerk Account

source: Days
nl_nl: Dagen

source: Man
nl_nl: Mannen

source: Women
nl_nl: Vrouwen

source: Users Statistics
nl_nl: Gebruikers Statistieken

source: Quick Stats
nl_nl: Snelle Stats

source: Today
nl_nl: Vandaag

source: Last week
nl_nl: Afgelopen week

source: This month
nl_nl: Dezemaand

source: This year (%0%)
nl_nl: Dit jaar (%0%)

source: All (since %0%)
nl_nl: Alles (since %0%)

source: All Members Logins
nl_nl: Alle Leden Logins

source: Men Members Logins
nl_nl: Mannelijke Leden Logins

source: Women Members Logins
nl_nl: Vrouwlijke Leden Logins

source: Couple Members Logins
nl_nl: Koppels Leden Logins

source: All Affiliates Logins
nl_nl: Alle Affiliates Logins

source: Men Affiliates Logins
nl_nl: Mannelijke Affiliates logins

source: Women Affiliates Logins
nl_nl: Vrouwelijke Affiliates logins

source: All Admins Logins
nl_nl: Alle Beheerder Logins

source: Men Admins Logins
nl_nl: Mannelijke Beheerders Logins

source: Women Admins Logins
nl_nl: Vrouwelijke Beheerder Logins

source: All Members Registrations
nl_nl: Alle Leden Registraties

source: Men Members Registrations
nl_nl: Mannelijke Leden Registraties

source: Women Members Registrations
nl_nl: Vrouwelijke Leden Registraties

source: Couple Members Registrations
nl_nl: Koppels Leden Registraties

source: All Affiliates Registrations
nl_nl: Alle Affiliates Registraties

source: Men Affiliates Registrations
nl_nl: Mannelijke Affiliates Registraties

source: Women Affiliates Registrations
nl_nl: Vrouwelijke Affiliates Registraties

source: All Admins Registrations
nl_nl: Alle Beheerders Registraties

source: Men Admins Registrations
nl_nl: Mannelijke Beheerders Registraties

source: Women Admins Registrations
nl_nl: Vrouwelijke Beheerders Registraties

source: Messages
nl_nl: Berichten

source: Profile Comments
nl_nl: Profiel Commentaar

source: Picture Comments
nl_nl: Foto Commentaar

source: Video Comments
nl_nl: Video Commentaar

source: Blog Comments
nl_nl: Blog Commentaar

source: Note Comments
nl_nl: Artikelen Commentaar

source: Game Comments
nl_nl: Game Commentaar

source: Latest <a href="%software_website%" title="%software_name%">Software</a>'s News
nl_nl: Laatste <a href="%software_website%" title="%software_name%">Software</a>Nieuws
