Repository: pH7Software/pH7-Social-Dating-CMS
Catalog: _protected/app/langs/*/LC_MESSAGES/global.po
Languages: nl_nl

source: Sign in to Admin Panel
nl_nl: Inloggen in het Administratie Paneel

source: Logs | Administration of Fake Admin
nl_nl: Logs | Administratie van de Nep Beheerder

source: Config | Fake Admin Honeypot
nl_nl: Configuratie | Nep Beheer Honingpot

source: Date: %0%
nl_nl: Datum: %0%

source: QUERY: %0%
nl_nl: ZOEKOPDRACHT: %0%

source: Referer: %0%
nl_nl: Verwijzer: %0%

source: LOGIN - Email: %0% - Username: %1% - Password: %2%
nl_nl: LOGIN - Email: %0% - Gebruikersnaam: %1% - Wachtwoord: %2%

source: Reporting of the Fake Admin Honeypot
nl_nl: Rapportage van de Nep Beheer Honingpot

source: Your Email:
nl_nl: Je Email Adres:

source: Your Username:
nl_nl: Je Gebruikersnaam:

source: Your Password:
nl_nl: Je Wachtword:

source: Enter the code above:
nl_nl: Voer de bovenstaande code in:

source: "Email", "Username" or "Password" is Incorrect
nl_nl: "Email", "Username" of "Password" is Onjuist

source: Done!
nl_nl: Gedaan!

source: WARNING!
nl_nl: WAARSCHUWING!

source: Please make a backup of your site and your database before proceeding with upgrade!
nl_nl: Maak aub een backup van je site en database, voordat je verder gaat met de upgrade!

source: Now you need to delete the following files via FTP or SSH:
nl_nl: Nu dien je via FTP of SSH de volgende bestanden te verwijderen:

source: Good luck :-)
nl_nl: Veel Geluk :-)

source: Please also delete all the cache files for the changes to take effect.
nl_nl: Leeg aub ook alle cache bestanden om de veranderingen te activeren.

source: Warning, this is not finished yet ;-)
nl_nl: Waarchuwing, het is nog niet helemaal afgerond ;-)

source: Edit your "%0%" file.
nl_nl: Bewerk je "%0%" bestand.

source: Add M after the size of the "upload.max_size" variable (e.g., this: "upload.max_size = 500M" instead of "upload.max_size = 500"
nl_nl: Voeg een M toe achter de grootte van de "upload.max_size" variable (zoals b.v.: "upload.max_size = 500M" in plaats van "upload.max_size = 500"

source: You must enter a valid login ID and password to access this resource.
nl_nl: Je dient een geldige login ID en wachtwoord in te voeren om toegang te krijgen tot deze bron.

source: Refund transaction valid.
nl_nl: Creditering transactie geldig.

source: Invalid refund transaction.
nl_nl: Ongeldige creditering transactie.

source: Purchase transaction valid.
nl_nl: Aankoop transactie geldig.

source: Invalid purchase transaction.
nl_nl: Ongeldige aankoop transactie.

source: Invalid connection to 2CheckOut.
nl_nl: Ongeldige verbinding met 2CheckOut.

source: Transaction valid and completed.
nl_nl: Transactie geldig en voltooid.

source: Transaction valid but not completed.
nl_nl: Transactie geldig maar niet voltooid.

source: Invalid transaction.
nl_nl: Ongeldige transactie.

source: Connection to PayPal failed.
nl_nl: Verbinding met PayPal mislukt.

source: Unknown OS
nl_nl: Onbekende OS

source: Unknown Web Browser
nl_nl: Onbekende Web Browser

source: Unknown Search Engine Bot
nl_nl: Onbekende Robot van Zoek Machine

source: Unknown Search Engine Bot IP
nl_nl: Onbekende IP van Robot behorende bij Zoek Machine

source: Best regards,<br />The %0% Team.
nl_nl: Met vriendelijke groeten,<br />The %0% Team.

source: This message was sent to %0%.<br /> You are receiving this message because you have registered on %1%.<br /> You can change the e-mail alerts by visiting your account.
nl_nl: Dit bericht is verzonden aan %0%.<br /> Je ontvangt dit bericht omdat je bent geregistreerd op %1%.<br /> Je kan je email meldingen veranderen via je account instellingen.

source: You have
nl_nl: Je hebt

source: message:
nl_nl: bericht:

source: error:
nl_nl: fout:

source: Meet New People on %0%, %1% with %site_name%!
nl_nl: Ontmoet Nieuwe Mensen op %0%, %1% met %site_name%!

source: Free registration for the feature Like.
nl_nl: Gratis registratie voor de toekomst Like.

source: Report Abuse
nl_nl: Rapporteer Misbruik

source: Report
nl_nl: Verslag

source: This HTTP parameter must be a %0% type!
nl_nl: Deze HTTP parameter moet van het %0% type zijn!

source: Oops! You have exceeded allowed login attemts. Please try again in %0% %1%.
nl_nl: Ohoh! Je hebt het aantal toegestane login pogingen overschreden. Probeer het opnieuw over %0% %1%.

source: Oops! It seems that you have already sent the same message to prevent spam you can not send multiple same content.
nl_nl: Ohoh! Het blijkt dat je dit bericht al verzonden hebt. Om spam te voorkomen kan je inhoudelijk dezelfde mails niet nogmaals versturen.

source: Oops! You have to wait %0% %1% before you can send another.
nl_nl: Ohoh! Wacht even %0% %1% voordat je nogmaals verzendt.

source: Oops! Somebody has recently registered with the same IP address. You have to wait %0% %1% before try again.
nl_nl: Ohoh! Iemand heeft onlangs geregistreerd met hetzelfde IP adres. Je dient %0% %1% te wachten om opnieuw te proberen.

source: minute
nl_nl: minuut

source: minutes
nl_nl: minuten

source: hour
nl_nl: uur

source: hours
nl_nl: uren

source: day
nl_nl: dag

source: days
nl_nl: dagen

source: %element% is invalid.
nl_nl: %element% is ongeldig.

source: Age
nl_nl: Leeftijd

source: years
nl_nl: jaren

source: character(s).
nl_nl: karakter(s).

source: Submit
nl_nl: Verstuur

source: Error: Your phone number is incorrect. Please enter full phone number with area code.
nl_nl: Fout: Je telefoonnummer is onjuist. Geef je telefoonnummer in met je kengetal.

source: Error: Your password has to contain from %0% to %1% characters.
nl_nl: Fout: Je wachtwoord dient tussen de %0% en %1% karakters te zijn .

source: Error: Invalid email address or this email is already used by another member.
nl_nl: Fout: Ongeldig email adres of dit email adres is al in gebruik door een ander lid.

source: Error: this %element% must contain %0% character(s) or more.
nl_nl: Fout: Deze %element% dient %0% karakter(s) of meer te bevatten.

source: Error: this %element% must contain %0% character(s) or less.
nl_nl: Error: Deze %element% dient %0% karakter(s) of minder te bevatten.

source: Please enter a string.
nl_nl: Geef aub een waarde in.

source: Error: You must accept our %element%.
nl_nl: Fout: Je dient %element% te accepteren.

source: Error: %element% must contain an email address.
nl_nl: Fout: %element% dient een email adres te bevatten.

source: Error: %element% is a required field.
nl_nl: Fout: %element% is een vereist veld.

source: Error: %element% must be numeric.
nl_nl: Fout: %element% moet nummeriek zijn.

source: Error: Another account with the same bank account already exists. Please choose another.
nl_nl: Fout: Een andere account met dezelfde bankgegevens bestaat al. Kies aub een ander.

source: Sorry, This bank account is not supported by our payment system.
nl_nl: Sorry, Deze bankrekekening wordt niet ondersteund door ons betaal systeem.

source: Error: Your bank account is incorrect!
nl_nl: Fout: Je bankrekening is onjuist!

source: Error: %element% must contain a valid date.
nl_nl: Fout: %element% moet een geldige datum bevatten.

source: The code of Captcha entered was incorrect. Please re-try.
nl_nl: De code van de ingegeven Captcha is onjuist. Probeer opnieuw.

source: Error: %element% must be alphanumeric (contain only numbers, letters, underscores, and/or hyphens).
nl_nl: Fout: %element% moet alfanummeriek zijn (alleen getallen, letters, liggend streepje, en/of leestekens).

source: Error: %element% contains invalid characters. Here is the rule to be observed: "%0%"
nl_nl: Fout: %element% bevat ongeldige karakters. Hier is de regel die even nagekenen dient te worden: "%0%"

source: %0% - Page Not Found
nl_nl: %0% - Pagina Niet Gevonden

source: Whoops! The page you requested was not found.
nl_nl: Ohoh! De opgevraagde pagina is niet gevonden.

source: You may have clicked an expired link or mistyped the address. Some web addresses are case sensitive.
nl_nl: Je kan een verlopen link hebben aangeklikt, of een adres verkeerd ingegeven hebben. Sommige adressen zijn hoofd en/of kleine letter(s) gevoelig.

source: Suggestions:
nl_nl: Suggesties:

source: Return home
nl_nl: Terug naar Home

source: Join Now
nl_nl: Nu Deelnemen

source: Go back to the previous page
nl_nl: Ga terug naar de vorige pagina

source: Access Denied!
nl_nl: Toegang Geweigerd!

source: Oops! You are not authorized to access this page!
nl_nl: Ohoh! Je bent niet geautoriseerd om toegang te hebben tot deze pagina!

source: Errors Reporting of the pH7 Framework
nl_nl: Foutmeldingen gerapporteerd door het pH7 Framework

source: %0% seconds ago.
nl_nl: %0% seconden geleden.

source: one minute ago.
nl_nl: één minuut geleden.

source: %0% minutes ago.
nl_nl: %0% minuten geleden.

source: one hour ago.
nl_nl: een uur geleden.

source: %0% hours ago.
nl_nl: %0% uren geleden.

source: one day ago.
nl_nl: één dag geleden.

source: %0% days ago.
nl_nl: %0% dagen geleden.

source: one week ago.
nl_nl: één week geleden.

source: %0% weeks ago.
nl_nl: %0% weken geleden.

source: one month ago.
nl_nl: één maand geleden.

source: %0% months ago.
nl_nl: %0% maanden geleden.

source: one year ago.
nl_nl: één jaar geleden.

source: %0% years ago.
nl_nl: %0% jaren geleden.

source: This cron has already been executed.
nl_nl: Deze cron is al uitgevoerd.

source: Free Dating Social Community - Your IP is banned
nl_nl: Gratis Dating Social Community - Je IP is geblokkeerd

source: banned,ban,dating site,free online dating social,social network,dating
nl_nl: geblokkeerd,bannen,banned,ban,dating site,gratis online dating social,social network,dating

source: dating site,free dating site,online dating site,social dating
nl_nl: dating site,gratis dating site,online dating site,social dating

source: Site Maintenance
nl_nl: Site Onderhoud

source: Whoops! Our website is currently down for maintenance.
nl_nl: Ai ai! Onze website in momenteel offline voor onderhoud.

source: Please come back later!
nl_nl: Kom later nog eens terug!

source: Kind regards, The Team.
nl_nl: Met vriendelijke groeten, The Team.

source: Did you mean %0%?
nl_nl: Bedoelde je %0%?

source: Upgrade %software_name% - %software_company% | Version %0%
nl_nl: Update %software_name% - %software_company% | Versie %0%

source: You must be logged in as administrator to upgrade your site.
nl_nl: Je dient ingelogd te zijn als beheerder om een upgrade uit te voeren.

source: No upgrade path for %software_name%!
nl_nl: Geen upgrade pad voor %software_name%!

source: Upgrade available for %software_name%:
nl_nl: Upgrade beschikbaar voor %software_name%:

source: Version Name: %0%, Version Number: %1%, Version Build: %2%
nl_nl: Versie Naam: %0%, Versie Nummer: %1%, Versie Samengesteld: %2%

source: Have you made a backup of your website files, folders and database?
nl_nl: Heb je een backup gemaakt van je website bestanden, folders en database?

source: Upgrade <span class="bold italic">%software_version_name% %software_version% Build %software_build%</span> to version <span class="bold italic">%0%</span>
nl_nl: Upgrade <span class="bold italic">%software_version_name% %software_version% Build %software_build%</span> naar versie <span class="bold italic">%0%</span>

source: Description of the upgrade patch:
nl_nl: Beschrijving van de patch:

source: Introductory instruction:
nl_nl: Instructies:

source: Bad "version name, version number or version build" of upgrade path!
nl_nl: Slechte "versie naam, versie nummer or version samengesteld" van het upgrade pad!

source: Upgrade path is not valid!
nl_nl: Upgrade pad is ongeldig!

source: Your update ran successfully!
nl_nl: Je update is met succes voltooid!

source: The upgrade directory <em>(~%0%)</em> has been deleted!
nl_nl: De upgrade directory <em>(~%0%)</em> is verwijderd!

source: The upgrade directory <em>(~%0%)</em> could not be deleted, please delete it manually using an FTP client or SSH.
nl_nl: De upgrade directory <em>(~%0%)</em> kon niet worden verwijderd. Doe dit handmatig via een FTP client of SSH.

source: Status... Failure!
nl_nl: Status... Storing!

source: Please delete the upgrade file using an FTP client or SSH.
nl_nl: Verwijder via een FTP client of SSH het upgrade bestand.

source: Conclusion of Instruction:
nl_nl: Conclusie van de Instructie:

source: Unable to execute the upgrade of the database SQL.<br />Error Message: %0%
nl_nl: Niet mogelijk om een upgrade uit te voeren op de database SQL.<br />Fout Melding: %0%

source: Your site must be in maintenance mode to begin the upgrade.
nl_nl: De site moet in de onderhoud modus worden gezet om de upgrade te beginnen.

source: You must put your site in development mode in order to launch the upgrade of your site!
nl_nl: De site moet in ontwikkelaar modus gezet te worden om een upgrade uit te voeren op je site!

source: 1) Please change the permission of the ~%0% file for writing for all groups (0666 in octal).
nl_nl: 1) Verander de permissie van het ~%0% bestand voor alle groepen (0666).

source: 2) Edit ~%0% file and find the code:
nl_nl: 2) Bewerk het ~%0% bestand en zoek de code:

source: and replace it with the code:
nl_nl: en vervang het met de code:

source: 3) After installation, please edit ~%0% file and find the code:
nl_nl: 3) Na de installatie, bewerk het ~%0% bestand en zoek de code::

source: 4) Change the permission of the file to write only for users and reading for the other groups (0644 in octal).
nl_nl: 4) Verander de permissie van het bestand naar alleen schrijven voor genruikers and aleen lezen voor andere groepen (0644).

source: You have %0% error(s):
nl_nl: Je hebt %0% fout(en):

source: Instruction file not found!
nl_nl: Introductie bestand niet gevonden!

source: The Jobs Cron is working to complete successfully!
nl_nl: De Cron Job is bezig om met succes af te ronden!

source: Chmod file... Ok!
nl_nl: chmod bestand... OK!

source: Restart Statistics... OK!
nl_nl: Herstart Statistieken... OK!

source: Backup of the Database... Ok!
nl_nl: Backup van de Database... OK!

source: Optimizing tables... OK!
nl_nl: Optimaliseren Tabellen... OK!

source: Repair of the Database... Ok!
nl_nl: Herstellen van de Database... OK!

source: Deleted %n% temporary message... OK!
nl_nl: Verwijderde %n% tijdelijk bericht... OK!

source: Deleting Log... OK!
nl_nl: Verwijderen Log... OK!

source: Deleted %0% %1% comment(s) ... OK!
nl_nl: Verwijderde%0% %1% commenta(a)r(en) ... OK!

source: Deleted %n% message... OK!
nl_nl: Verwijderde %n% bericht... OK!

source: No birthday today.
nl_nl: Geen verjaardagen vandaag.

source: %n% email sent.
nl_nl: %n% email verstuurd.

source: Please <b>register</b> or <b>login</b> to vote this.
nl_nl: <b>Registreer</b> of <b>login</b>om hierop te stemmen.

source: peoples have voted for this!
nl_nl: mensen hebben hiervoor gestemd!

source: people have voted for this!
nl_nl: mensen hebben hiervoor gestemd!

source: Please <b>register</b> or <b>login</b> to vote.
nl_nl: <b>Registreer</b> of <b>login</b>om hierop te stemmen.

source: You can not vote your own profile!
nl_nl: Je kan niet op je eigen profiel stemmen!

source: You have already voted!
nl_nl: Je hebt al gestemd!

source: Votes
nl_nl: Stemmen

source: Vote
nl_nl: Stem

source: This Username is available!
nl_nl: Deze Gebruikersnaam is beschikbaar!

source: Sorry, but this Username is not available.
nl_nl: Sorry, maar deze gebruikersnaam is niet beschikbaar.

source: Invalid Email Address!
nl_nl: Ongeldig Email Adres!

source: This email already used by another member.
nl_nl: Dit email adres is al in gebruik door een ander lid.

source: Oops! "%s" is not associated with any %site_name% account.
nl_nl: Ohoh! "%s" is niet gekoppeld aan enig %site_name% account.

source: Valid Email!
nl_nl: Geldige Email Adres!

source: Your Password has to contain from %d to %d characters.
nl_nl: Je Wachtwoord dient tussen de %d en %d karakters te bevatten.

source: Password is correct!
nl_nl: Wachtwoord is juist!

source: Your must enter a date valid (Month/Day/Year).
nl_nl: Je moet een geldige datum invoeren (Maand/Dag/Jaar).

source: You must be %d to %d years to register on the site.
nl_nl: Je dient tussen de %d en %d jaar te zijn om op deze site te mogen registreren.

source: Please, enter %d character(s) or more.
nl_nl: Gelieve%d karakter(s) of meer te gebruiken.

source: Please, enter %d character(s) or less.
nl_nl: Gelieve%d karakter(s) of minder te gebruiken.

source: This field is required!
nl_nl: Dit veld is vereist!

source: Your must enter a valid url (e.g. http://www.coolonweb.com).
nl_nl: Je dient een geldige URL in te geven (bijvoorbeeld http://www.leukophetweb.nl).

source: Captcha check failed!
nl_nl: Captcha controle ongeldig!

source: Please enter a correct phone number with area code!
nl_nl: Gelieve een juist telefoonnummer met kengetal in te geven!

source: You must read and approve the terms of use!
nl_nl: Je dient eerst de gerbuikersvoorwaarden te lezen en goed te keuren!

source: Bad parameters in the URL!
nl_nl: Slechte parameters in de URL!

source: Share URL:
nl_nl: Deel URL:

source: Send Activation
nl_nl: Stuur Activatie

source: I am a:
nl_nl: Ik ben een:

source: Male
nl_nl: Man

source: Woman
nl_nl: Vrouw

source: Couple
nl_nl: Koppel

source: Looking for:
nl_nl: Kijken naar:

source: Country:
nl_nl: Land:

source: City:
nl_nl: Plaats:

source: Latest members
nl_nl: Laatste leden

source: Only with Avatar
nl_nl: Alleen met Avatar

source: Only Online
nl_nl: Alleen Onine

source: Search
nl_nl: Zoeken

source: ZIP/Postal Code:
nl_nl: Postcode:

source: Email Address:
nl_nl: Email adres:

source: Browse By:
nl_nl: Bladeren Door:

source: Latest Members
nl_nl: Laatste Leden

source: Last Activity
nl_nl: Laatste Activiteit

source: Most Popular
nl_nl: Meest Populair

source: Top Rated
nl_nl: Hoogste Waardering

source: Username
nl_nl: Gebruikersnaam

source: First Name
nl_nl: Voornaam

source: Last Name
nl_nl: Achternaam

source: Direction:
nl_nl: Richting:

source: Descending
nl_nl: Aflopend

source: Ascending
nl_nl: Oplopend

source: Why:
nl_nl: Waarom:

source: I do not like the site
nl_nl: Ik vind deze site niet leuk

source: I met someone
nl_nl: Ik heb iemand ontmoet

source: Other, I put the answer in the message!
nl_nl: Anders, Ik zal het vertellen in het bericht!

source: Embed Code
nl_nl: Embedded Code

source: Warning, this action is irreversible!
nl_nl: Waarschuwing, deze actie in onomkeerbaar!

source: Cancel
nl_nl: Annuleer

source: Enable
nl_nl: Aan

source: Disable
nl_nl: Uit

source: Your Country:
nl_nl: Je Land:

source: Your City:
nl_nl: Je Woonplaats:

source: Your State or Province:
nl_nl: Je Staat of Provincie:

source: Middle Name:
nl_nl: Tussenvoegsel:

source: Height:
nl_nl: Lengte:

source: Weight:
nl_nl: Gewicht:

source: Social Network Site:
nl_nl: Social Netwerk Site:

source: Your Website:
nl_nl: Je Website:

source: The url of your profile Facebook, Twitter, Google+, etc.
nl_nl: De link naar je profiel op Facebook, Twitter, Google+, etc.

source: Your Website/Blog
nl_nl: Je Website/Blog

source: Your Fax Number:
nl_nl: Je Fax Nummer:

source: Your Phone Number:
nl_nl: Je Telefoonnummer:

source: Enter full number with area code.
nl_nl: Voer je volledige nummer met kengetal in.

source: Old password:
nl_nl: Oud wachtwoord:

source: New password:
nl_nl: Nieuw wachtwoord:

source: Repeat new password:
nl_nl: Herhaal nieuw wachtwoord:

source: Change Password!
nl_nl: Verander Wachtwoord!

source: The passwords do not match.
nl_nl: De wachtwoorden zijn niet eender

source: The old and new passwords are identical. So why do you change your password?
nl_nl: Het oude en het nieuwe wachtwoord zijn hetzelfde. Waarom ben je het wachtwoord aan het wijzigen?

source: The old password is not correct.
nl_nl: Het oude wachtwoord is onjuist.

source: Your password has been correctly updated.
nl_nl: Je wachtwoord is correct bijgewerkt.

source: Oops, this "%0%" is not associated with any %site_name% account. Please, make sure that you entered the e-mail address used in creating your account.
nl_nl: Ohoh!, de "%0%" is niet gekoppeld aan enig %site_name% account. Gelieve er zeker van te zijn dat het ingegeven email adres gelijk is bij destijds aanmaken van het account.

source: Oops! Your account is already activated.
nl_nl: Ohoh! Je account is al reeds geactiveerd.

source: Welcome to %site_name%, %0%!
nl_nl: Welkom op %site_name%, %0%!

source: Hello %0% - We are proud to welcome you as a member of %site_name%!
nl_nl: Hallo %0% - We zijn er trots op om je te mogen verwelkomen op %site_name%!

source: Your hash validation is <em>"%0%"</em>.
nl_nl: Je hash validatie is <em>"%0%"</em>.

source: Please save the following information for future refenrence:
nl_nl: Bewaar de volgende informatie voor latere referenties:

source: Username:
nl_nl: Gebruikersnaam:

source: Password: ***** (This field is hidden to protect against theft of your account).
nl_nl: Wachtwoord: ***** (Dit veld is onleesbaar om eventuele diefstal tegen te gaan).

source: You are receiving this mail because we received an application for registration with the email "%0%" has been provided in the form of %site_name% (%site_url%).
nl_nl: Je ontvangt deze email omdat we een aanvraag tot registratie hebben ontvangen bij de e-mail "% 0% " die is verstrekt in de vorm van% site_name% (% site_url%).

source: If you think someone has used your email address without your knowledge to create an account on %site_name%, please contact us using our contact form available on our website.
nl_nl: Als je denkt dat iemand je email adres heeft gebruikt zonder dat je hiervan afwist om een account aan te maken op %site_name%, neem dan aub contact met ons op via het contactformulier op onze website.

source: Your new password - %site_name%
nl_nl: Je nieuwe wachtwoord - %site_name%

source: Your hash validation has been emailed to you.
nl_nl: Je hash validatie is via email naar je verstuurd.

source: Oops! This password you entered is incorrect.
nl_nl: Ohoh! Het wachtwoord wat je hebt ingegeven is onjuist.

source: Member
nl_nl: Lid

source: Type of Membership: %0%.
nl_nl: Soort Lidmaatschap: %0%.

source: User Information
nl_nl: Gebruikers Informatie

source: Email: %0%
nl_nl: Email Adres: %0%

source: Username: %0%
nl_nl: Gebruikersnaam: %0%

source: First Name: %0%
nl_nl: Voornaam %0%

source: Sex: %0%
nl_nl: Geslacht: %0%

source: User IP: %0%
nl_nl: Gebruiker IP: %0%

source: Unregister %0% - User: %1%
nl_nl: Afmelden %0% - Gebruiker: %1%

source: The file content could not be saved!
nl_nl: Het bestand kon niet worden bewaard!

source: Administration of %site_name%
nl_nl: Beheerder van %site_name%

source: Meet %0% on %site_name%!
nl_nl: Ontmoet %0% op %site_name%!

source: I am a %0% and I am looking %1%.
nl_nl: Ik ben een %0% en ik bekijk %1%.

source: I from %0%, %1%.
nl_nl: Ik van %0%, %1%

source: Meet %0% on %site_name%
nl_nl: Ontmoet %0% op %site_name%

source: Busy
nl_nl: Bezig

source: Away
nl_nl: Weg

source: Categories:
nl_nl: Categorieën:

source: Sorry, your account has not yet been activated. Please activate it by clicking the activation link that was emailed.
nl_nl: Sorry, je account is nog niet geactiveerd. Activeer het door te klikken op de activatielink die naar je is gemaild.

source: Sorry, your account has not yet been activated. An administrator must validate your account.
nl_nl: Sorry, je account is nog niet geactiveerd. Een beheerder zal eerst je account valideren.

source: Your account does not have a valid activation status. Please contact the database administrator so that it solves this problem.
nl_nl: Je account heeft geen geldige activatie statues. Neem contact op met de database beheerder om dit probleem op te lossen.

source: Sorry, Your account has been banned.
nl_nl: Sorry, Je account is verbannen.

source: Your subscription to our newsletters has been successfully validated!
nl_nl: De inschrijving voor onze nieuwsbrieven is met succes gevalideerd!
